{
  "Records: {{from}} - {{to}} / {{total}}": "Enregistrements : {{from}}-{{to}}/{{total}}",
  "Records: {{total}}": "Enregistrements : {{total}}",
  "{{pageLength}} per page": "{{pageLength}} par page",
  "New update available": "Nouvelle mise à jour disponible",
  "Command succeeded": "Commande réussie",
  "Command failed ({{err}})": "Échec de la commande ({{err}})",
  "My Account": "Mon compte",
  "Signed in as {{name}}": "Connecté comme {{name}}",
  "Account": "Compte",
  "Sign Out": "Fermer la session",
  "Options": "Options",
  "Command": "Commande",
  "Show notifications": "Afficher les notifications",
  "Help": "Aide",
  "Report an issue": "Signaler un problème",
  "Cycle Start": "Cycle de démarrage",
  "Feedhold": "Maintien d'avance",
  "Homing": "Origines",
  "Sleep": "Veille",
  "Unlock": "Déverrouiller",
  "Reset": "Réinitialiser",
  "Authentication failed.": "Authentification échouée.",
  "Error": "Erreur",
  "Sign in to {{name}}": "Connectez-vous à {{name}}",
  "Username": "Nom d'utilisateur",
  "Password": "Mot de passe",
  "Sign In": "Se connecter",
  "Forgot your password?": "Mot de passe oublié?",
  "A web-based interface for CNC milling controller running Grbl, Smoothieware, or TinyG": "Une interface web pour contrôleur de fraisage CNC utilisant Grbl, Smoothieware ou TinyG",
  "Learn more": "En savoir plus",
  "Downloads": "Téléchargements",
  "Checking for updates...": "Recherche des mises à jour...",
  "A new version of {{name}} is available": "Une nouvelle version de {{name}} est disponible",
  "Version {{version}}": "Version {{version}}",
  "Latest version": "Dernière version",
  "You already have the newest version of {{name}}": "Vous avez déjà la version la plus récente de {{name}}",
  "New": "Nouveau",
  "Account status": "Statut du compte",
  "Name": "Nom",
  "Confirm Password": "Confirmer le mot de passe",
  "Cancel": "Annuler",
  "OK": "OK",
  "An unexpected error has occurred.": "Une erreur inattendue est survenue.",
  "Loading...": "Chargement...",
  "No data to display": "Aucune donnée à afficher",
  "Enabled": "Activé",
  "Disabled": "Désactivé",
  "Date Modified": "Date de modification",
  "Action": "Action",
  "Edit Account": "Modifier le compte",
  "Delete Account": "Supprimer le compte",
  "Settings": "Paramètres",
  "Are you sure you want to delete the account?": "Êtes-vous sûr de vouloir supprimer le compte?",
  "Update": "Mettre à jour",
  "Old Password": "Ancien mot de passe",
  "Change Password": "Changer le mot de passe",
  "New Password": "Nouveau mot de passe",
  "Commands": "Commandes",
  "Title": "Titre",
  "and more...": "et plus...",
  "Delete": "Supprimer",
  "Are you sure you want to delete this item?": "Êtes-vous sûr de vouloir supprimer cet élément?",
  "Exception": "Exception",
  "Continue execution when an error is detected in the G-code program": "Continuer l'exécution lorsqu'une erreur est détectée dans le programme G-code",
  "Enabling this option may cause machine damage if you don't have an Emergency Stop button to prevent a dangerous situation.": "Activer cette option peut provoquer des dégâts à la machine si vous n'avez pas de bouton d'arrêt d'urgence pour éviter une situation dangereuse.",
  "Save Changes": "Enregistrer les modifications",
  "Events": "Événements",
  "Event": "Événement",
  "Choose an event": "Choisir un événement",
  "Startup (System only)": "Démarrage (Système uniquement)",
  "Open a serial port (System only)": "Ouvrir un port série (Système uniquement)",
  "Close a serial port (System only)": "Fermer un port série (Système uniquement)",
  "G-code: Load": "G-code : Chargement",
  "G-code: Unload": "G-code : Déchargement",
  "G-code: Start": "G-code : Démarrage",
  "G-code: Stop": "G-code : Arrêt",
  "G-code: Pause": "G-code : Pause",
  "G-code: Resume": "G-code : Reprise",
  "Feed Hold": "Maintien de l'avance",
  "Run Macro": "Exécuter une macro",
  "Load Macro": "Charger une macro",
  "Trigger": "Déclencheur",
  "Choose an trigger": "Choisir un déclencheur",
  "System": "Système",
  "G-code": "G-code",
  "Automatically check for updates": "Vérification automatique des mises à jour",
  "Language": "Langue",
  "General": "Généralités",
  "Workspace": "Espace de travail",
  "Controller": "Contrôleur",
  "About": "À propos de",
  "The account name is already being used. Choose another name.": "Le nom de compte est déjà utilisé. Choisissez un autre nom.",
  "Passwords do not match.": "Les mots de passe ne correspondent pas.",
  "Import": "Importer",
  "Are you sure you want to overwrite the workspace settings?": "Êtes-vous sûr de vouloir écraser les paramètres de l'espace de travail?",
  "Restore Defaults": "Restaurer défaut",
  "Are you sure you want to restore the default settings?": "Êtes-vous sûr de vouloir restaurer la configuration par défaut?",
  "Import Error": "Erreur d'importation",
  "Invalid file format.": "Format de fichier invalide.",
  "Close": "Fermer",
  "Export": "Exporter",
  "Click the Continue button to resume execution.": "Cliquez sur le bouton Continuer pour reprendre l'exécution.",
  "Stop": "Arrêter",
  "Continue": "Continuer",
  "Server has stopped working": "Le serveur a cessé de fonctionner",
  "A problem caused the server to stop working correctly. Check out the server status and try again.": "Un problème a causé l'arrêt du serveur. Vérifiez l'état du serveur et réessayez.",
  "Reload": "Recharger",
  "Fork Widget": "Dupliquer le module",
  "Are you sure you want to fork this widget?": "Êtes-vous sûr de vouloir dupliquer ce module?",
  "Remove Widget": "Supprimer le module",
  "Are you sure you want to remove this widget?": "Êtes-vous sûr de vouloir supprimer ce module?",
  "On": "Oui",
  "Off": "Non",
  "Visualizer Widget": "Module de visualisation",
  "This widget visualizes a G-code file and simulates the tool path.": "Ce module affiche le fichier G-code et simule le chemin de l'outil.",
  "Connection Widget": "Module de connexion",
  "This widget lets you establish a connection to a serial port.": "Ce module vous permet d'établir la connexion au port série.",
  "Console Widget": "Module console",
  "This widget lets you read and write data to the CNC controller connected to a serial port.": "Ce module vous permet d'envoyer des commandes au contrôleur CNC connecté au port série.",
  "Grbl Widget": "Module Grbl",
  "This widget shows the Grbl state and provides Grbl specific features.": "Ce module affiche l'état du Grbl et fournit les fonctionnalités spécifiques à Grbl.",
  "Marlin Widget": "Module Marlin",
  "This widget shows the Marlin state and provides Marlin specific features.": "Ce module affiche l'état du Marlin et fournit les fonctionnalités spécifiques à Marlin.",
  "Smoothie Widget": "Module Smoothie",
  "This widget shows the Smoothie state and provides Smoothie specific features.": "Ce module affiche l'état du Smoothie et fournit les fonctionnalités spécifiques à Smoothie.",
  "TinyG Widget": "Module TinyG",
  "This widget shows the TinyG state and provides TinyG specific features.": "Ce module affiche l'état du TinyG et fournit les fonctionnalités spécifiques à TinyG.",
  "Axes Widget": "Module Axes",
  "This widget shows the XYZ position. It includes jog controls, homing, and axis zeroing.": "Ce module affiche la position XYZ. Il inclut les commandes de déplacement manuel, le homing, remise à zéro des axes.",
  "G-code Widget": "Module G-code",
  "This widget shows the current status of G-code commands.": "Ce module affiche l'état des commandes G-code.",
  "Laser Widget": "Module Laser",
  "This widget allows you control laser intensity and turn the laser on/off.": "Ce module vous permet de contrôler l'intensité du laser et de l'allumer/éteindre.",
  "Macro Widget": "Module Macro",
  "This widget can use macros to automate routine tasks.": "Ce module peut utiliser des macros pour automatiser les tâches de routine.",
  "Probe Widget": "Module de palpage",
  "This widget helps you use a touch plate to set your Z zero offset.": "Ce module vous aide à palper le plateau pour définir le décalage en Z.",
  "Spindle Widget": "Module Broche",
  "This widget provides the spindle control.": "Ce module fournit le contrôle de la broche.",
  "Custom Widget": "Module personnalisé",
  "This widget gives you a communication interface for creating your own widget.": "Ce module vous offre une interface de communication pour créer votre propre module.",
  "Webcam Widget": "Module webcam",
  "This widget lets you monitor a webcam.": "Ce module vous permet de gérer une webcam.",
  "Widgets": "Modules",
  "M0 Program Pause": "Pause du programme M0",
  "M1 Program Pause": "Pause du programme M1",
  "M2 Program End": "Fin du programme M2",
  "M30 Program End": "Fin du programme M30",
  "M6 Tool Change": "Changement outil M6",
  "M109 Set Extruder Temperature": "M109 Régler Température de l'extrudeuse",
  "M190 Set Heated Bed Temperature": "M190 Régler Température du plateau chauffant",
  "Drop G-code file here": "Déposez un fichier G-code ici",
  "Manage Widgets ({{inactiveCount}})": "Gérer les modules ({{inactiveCount}})",
  "Collapse All": "Tout réduire",
  "Expand All": "Tout étendre",
  "Corrupted workspace settings": "Paramètres de l'espace de travail corrompus",
  "The workspace settings have become corrupted or invalid. Click Restore Defaults to restore default settings and continue.": "Les paramètres de l'espace de travail sont corrompus ou invalides. Cliquez sur Restaurer défaut pour rétablir les paramètres par défaut et continuer.",
  "Download workspace settings": "Télécharger les paramètres de l'espace de travail",
  "This field is required.": "Ce champ est obligatoire.",
  "Passwords should be equal.": "Les mots de passe doivent être identiques.",
  "Work Coordinate System (G54)": "Système de coordonnées de travail (G54)",
  "Work Coordinate System (G55)": "Système de coordonnées de travail (G55)",
  "Work Coordinate System (G56)": "Système de coordonnées de travail (G56)",
  "Work Coordinate System (G57)": "Système de coordonnées de travail (G57)",
  "Work Coordinate System (G58)": "Système de coordonnées de travail (G58)",
  "Work Coordinate System (G59)": "Système de coordonnées de travail (G59)",
  "Go To Work Zero (G0 X0 Y0 Z0)": "Aller au zéro de travail (G0 X0 Y0 Z0)",
  "Zero Out Work Offsets (G10 L20 P1 X0 Y0 Z0)": "Définir comme zéro de travail (G10 L20 P1 X0 Y0 Z0)",
  "Zero Out Work Offsets (G10 L20 P2 X0 Y0 Z0)": "Définir comme zéro de travail (G10 L20 P2 X0 Y0 Z0)",
  "Zero Out Work Offsets (G10 L20 P3 X0 Y0 Z0)": "Définir comme zéro de travail (G10 L20 P3 X0 Y0 Z0)",
  "Zero Out Work Offsets (G10 L20 P4 X0 Y0 Z0)": "Définir comme zéro de travail (G10 L20 P4 X0 Y0 Z0)",
  "Zero Out Work Offsets (G10 L20 P5 X0 Y0 Z0)": "Définir comme zéro de travail (G10 L20 P5 X0 Y0 Z0)",
  "Zero Out Work Offsets (G10 L20 P6 X0 Y0 Z0)": "Définir comme zéro de travail (G10 L20 P6 X0 Y0 Z0)",
  "Temporary Offsets (G92)": "Déplacement temporaire (G92)",
  "Zero Out Temporary Offsets (G92 X0 Y0 Z0)": "Définir temporairement le zéro (G92 X0 Y0 Z0)",
  "Un-Zero Out Temporary Offsets (G92.1 X0 Y0 Z0)": "Supprimer le zéro temporaire (G92.1 X0 Y0 Z0)",
  "Machine Coordinate System (G53)": "Système de coordonnées machine (G53)",
  "Go To Machine Zero (G53 G0 X0 Y0 Z0)": "Aller au zéro machine (G53 G0 X0 Y0 Z0)",
  "Set Machine Zero (G28.3 X0 Y0 Z0)": "Définir le zéro machine (G28.3 X0 Y0 Z0)",
  "Homing Sequence (G28.2 X0 Y0 Z0)": "Séquence de retour au zéro (G28.2 X0 Y0 Z0)",
  "Go To Work Zero On X Axis (G0 X0)": "Aller au zéro de travail de l'axe X (G0 X0)",
  "Zero Out Work X Axis (G10 L20 P1 X0)": "Définir comme zéro de travail pour l'axe X (G10 L20 P1 X0)",
  "Zero Out Work X Axis (G10 L20 P2 X0)": "Définir comme zéro de travail pour l'axe X (G10 L20 P2 X0)",
  "Zero Out Work X Axis (G10 L20 P3 X0)": "Définir comme zéro de travail pour l'axe X (G10 L20 P3 X0)",
  "Zero Out Work X Axis (G10 L20 P4 X0)": "Définir comme zéro de travail pour l'axe X (G10 L20 P4 X0)",
  "Zero Out Work X Axis (G10 L20 P5 X0)": "Définir comme zéro de travail pour l'axe X (G10 L20 P5 X0)",
  "Zero Out Work X Axis (G10 L20 P6 X0)": "Définir comme zéro de travail pour l'axe X (G10 L20 P6 X0)",
  "Zero Out Temporary X Axis (G92 X0)": "Définir temporairement le zéro pour l'axe X (G92 X0)",
  "Un-Zero Out Temporary X Axis (G92.1 X0)": "Supprimer le zéro temporaire pour l'axe X (G92.1 X0)",
  "Go To Machine Zero On X Axis (G53 G0 X0)": "Aller au zéro machine de l'axe X (G53 G0 X0)",
  "Zero Out Machine X Axis (G28.3 X0)": "Définir le zéro machine pour l'axe X (G28.3 X0)",
  "Home Machine X Axis (G28.2 X0)": "Rentrer à l'origine machine pour l'axe X (G28.2 X0)",
  "Go To Work Zero On Y Axis (G0 Y0)": "Aller au zéro de travail de l'axe Y (G0 Y0)",
  "Zero Out Work Y Axis (G10 L20 P1 Y0)": "Définir comme zéro de travail pour l'axe Y (G10 L20 P1 Y0)",
  "Zero Out Work Y Axis (G10 L20 P2 Y0)": "Définir comme zéro de travail pour l'axe Y (G10 L20 P2 Y0)",
  "Zero Out Work Y Axis (G10 L20 P3 Y0)": "Définir comme zéro de travail pour l'axe Y (G10 L20 P3 Y0)",
  "Zero Out Work Y Axis (G10 L20 P4 Y0)": "Définir comme zéro de travail pour l'axe Y (G10 L20 P4 Y0)",
  "Zero Out Work Y Axis (G10 L20 P5 Y0)": "Définir comme zéro de travail pour l'axe Y (G10 L20 P5 Y0)",
  "Zero Out Work Y Axis (G10 L20 P6 Y0)": "Définir comme zéro de travail pour l'axe Y (G10 L20 P6 Y0)",
  "Zero Out Temporary Y Axis (G92 Y0)": "Définir temporairement le zéro pour l'axe Y (G92 Y0)",
  "Un-Zero Out Temporary Y Axis (G92.1 Y0)": "Supprimer le zéro temporaire pour l'axe Y (G92.1 Y0)",
  "Go To Machine Zero On Y Axis (G53 G0 Y0)": "Aller au zéro machine de l'axe Y (G53 G0 Y0)",
  "Zero Out Machine Y Axis (G28.3 Y0)": "Définir le zéro machine pour l'axe Y (G28.3 Y0)",
  "Home Machine Y Axis (G28.2 Y0)": "Rentrer à l'origine machine pour l'axe Y (G28.2 Y0)",
  "Go To Work Zero On Z Axis (G0 Z0)": "Aller au zéro de travail de l'axe Z (G0 Z0)",
  "Zero Out Work Z Axis (G10 L20 P1 Z0)": "Définir comme zéro de travail pour l'axe Z (G10 L20 P1 Z0)",
  "Zero Out Work Z Axis (G10 L20 P2 Z0)": "Définir comme zéro de travail pour l'axe Z (G10 L20 P2 Z0)",
  "Zero Out Work Z Axis (G10 L20 P3 Z0)": "Définir comme zéro de travail pour l'axe Z (G10 L20 P3 Z0)",
  "Zero Out Work Z Axis (G10 L20 P4 Z0)": "Définir comme zéro de travail pour l'axe Z (G10 L20 P4 Z0)",
  "Zero Out Work Z Axis (G10 L20 P5 Z0)": "Définir comme zéro de travail pour l'axe Z (G10 L20 P5 Z0)",
  "Zero Out Work Z Axis (G10 L20 P6 Z0)": "Définir comme zéro de travail pour l'axe Z (G10 L20 P6 Z0)",
  "Zero Out Temporary Z Axis (G92 Z0)": "Définir temporairement le zéro pour l'axe Z (G92 Z0)",
  "Un-Zero Out Temporary Z Axis (G92.1 Z0)": "Supprimer le zéro temporaire pour l'axe Z (G92.1 Z0)",
  "Go To Machine Zero On Z Axis (G53 G0 Z0)": "Aller au zéro machine de l'axe Z (G53 G0 Z0)",
  "Zero Out Machine Z Axis (G28.3 Z0)": "Définir le zéro machine pour l'axe Z (G28.3 Z0)",
  "Home Machine Z Axis (G28.2 Z0)": "Rentrer à l'origine machine pour l'axe Z (G28.2 Z0)",
  "Go To Work Zero On A Axis (G0 A0)": "Aller au zéro de travail de l'axe A (G0 A0)",
  "Zero Out Work A Axis (G10 L20 P1 A0)": "Définir comme zéro de travail pour l'axe A (G10 L20 P1 A0)",
  "Zero Out Work A Axis (G10 L20 P2 A0)": "Définir comme zéro de travail pour l'axe A (G10 L20 P2 A0)",
  "Zero Out Work A Axis (G10 L20 P3 A0)": "Définir comme zéro de travail pour l'axe A (G10 L20 P3 A0)",
  "Zero Out Work A Axis (G10 L20 P4 A0)": "Définir comme zéro de travail pour l'axe A (G10 L20 P4 A0)",
  "Zero Out Work A Axis (G10 L20 P5 A0)": "Définir comme zéro de travail pour l'axe A (G10 L20 P5 A0)",
  "Zero Out Work A Axis (G10 L20 P6 A0)": "Définir comme zéro de travail pour l'axe A (G10 L20 P6 A0)",
  "Zero Out Temporary A Axis (G92 A0)": "Définir temporairement le zéro pour l'axe A (G92 A0)",
  "Un-Zero Out Temporary A Axis (G92.1 A0)": "Supprimer le zéro temporaire pour l'axe A (G92.1 A0)",
  "Go To Machine Zero On A Axis (G53 G0 A0)": "Aller au zéro machine de l'axe A (G53 G0 A0)",
  "Zero Out Machine A Axis (G28.3 A0)": "Définir le zéro machine pour l'axe A (G28.3 A0)",
  "Home Machine A Axis (G28.2 A0)": "Rentrer à l'origine machine pour l'axe A (G28.2 A0)",
  "Go To Work Zero On B Axis (G0 B0)": "Aller au zéro de travail de l'axe B (G0 B0)",
  "Zero Out Work B Axis (G10 L20 P1 B0)": "Définir comme zéro de travail pour l'axe B (G10 L20 P1 B0)",
  "Zero Out Work B Axis (G10 L20 P2 B0)": "Définir comme zéro de travail pour l'axe B (G10 L20 P2 B0)",
  "Zero Out Work B Axis (G10 L20 P3 B0)": "Définir comme zéro de travail pour l'axe B (G10 L20 P3 B0)",
  "Zero Out Work B Axis (G10 L20 P4 B0)": "Définir comme zéro de travail pour l'axe B (G10 L20 P4 B0)",
  "Zero Out Work B Axis (G10 L20 P5 B0)": "Définir comme zéro de travail pour l'axe B (G10 L20 P5 B0)",
  "Zero Out Work B Axis (G10 L20 P6 B0)": "Définir comme zéro de travail pour l'axe B (G10 L20 P6 B0)",
  "Zero Out Temporary B Axis (G92 B0)": "Définir temporairement le zéro pour l'axe B (G92 B0)",
  "Un-Zero Out Temporary B Axis (G92.1 B0)": "Supprimer le zéro temporaire pour l'axe B (G92.1 B0)",
  "Go To Machine Zero On B Axis (G53 G0 B0)": "Aller au zéro machine de l'axe B (G53 G0 B0)",
  "Zero Out Machine B Axis (G28.3 B0)": "Définir le zéro machine pour l'axe B (G28.3 B0)",
  "Home Machine B Axis (G28.2 B0)": "Rentrer à l'origine machine pour l'axe B (G28.2 B0)",
  "Go To Work Zero On C Axis (G0 C0)": "Aller au zéro de travail de l'axe C (G0 C0)",
  "Zero Out Work C Axis (G10 L20 P1 C0)": "Définir comme zéro de travail pour l'axe C (G10 L20 P1 C0)",
  "Zero Out Work C Axis (G10 L20 P2 C0)": "Définir comme zéro de travail pour l'axe C (G10 L20 P2 C0)",
  "Zero Out Work C Axis (G10 L20 P3 C0)": "Définir comme zéro de travail pour l'axe C (G10 L20 P3 C0)",
  "Zero Out Work C Axis (G10 L20 P4 C0)": "Définir comme zéro de travail pour l'axe C (G10 L20 P4 C0)",
  "Zero Out Work C Axis (G10 L20 P5 C0)": "Définir comme zéro de travail pour l'axe C (G10 L20 P5 C0)",
  "Zero Out Work C Axis (G10 L20 P6 C0)": "Définir comme zéro de travail pour l'axe C (G10 L20 P6 C0)",
  "Zero Out Temporary C Axis (G92 C0)": "Définir temporairement le zéro pour l'axe C (G92 C0)",
  "Un-Zero Out Temporary C Axis (G92.1 C0)": "Supprimer le zéro temporaire pour l'axe C (G92.1 C0)",
  "Go To Machine Zero On C Axis (G53 G0 C0)": "Aller au zéro machine de l'axe C (G53 G0 C0)",
  "Zero Out Machine C Axis (G28.3 C0)": "Définir le zéro machine pour l'axe C (G28.3 C0)",
  "Home Machine C Axis (G28.2 C0)": "Rentrer à l'origine machine pour l'axe C (G28.2 C0)",
  "mm": "mm",
  "in": "pouces",
  "deg": "degrés",
  "Zero Out Machine": "Supprimer zéro machine",
  "Home Machine": "Rentrer à l'origine machine",
  "Zero Out Work Offsets": "Supprimer zéro de travail",
  "Set Work Offsets": "Définir zéro de travail",
  "Axis": "Axe",
  "Machine Position": "Position de la machine",
  "Work Position": "Position de travail",
  "Axes": "Axes",
  "Keypad jogging": "Déplacement au clavier",
  "Edit": "Éditer",
  "Expand": "Élargir",
  "Collapse": "Réduire",
  "More": "Plus",
  "Enter Full Screen": "Entrer en plein écran",
  "Exit Full Screen": "Quitter le plein écran",
  "Move X- Y+": "Déplacer X- Y+",
  "Move Y+": "Déplacer Y+",
  "Move X+ Y+": "Déplacer X+ Y+",
  "Move Z+": "Déplacer Z+",
  "Move X-": "Déplacer X-",
  "Move To XY Zero (G0 X0 Y0)": "Déplacer à zéro XY (G0 X0 Y0)",
  "Move X+": "Déplacer X+",
  "Move To Z Zero (G0 Z0)": "Déplacer Z à zéro",
  "Move X- Y-": "Déplacer X- Y-",
  "Move Y-": "Déplacer Y-",
  "Move X+ Y-": "Déplacer X+ Y-",
  "Move Z-": "Déplacer Z-",
  "Units": "Unités",
  "G20 (inch)": "G20 (pouces)",
  "G21 (mm)": "G21 (mm)",
  "Imperial": "Impérial",
  "Metric": "Métrique",
  "Right": "Droite",
  "Left": "Gauche",
  "Up": "Haut",
  "Down": "Bas",
  "Page Up": "Page haut",
  "Page Down": "Page bas",
  "Right Square Bracket": "Crochet droit",
  "Left Square Bracket": "Crochet gauche",
  "0.1x Move": "Déplacement 0.1x",
  "Alt": "Alt",
  "10x Move": "Déplacement 10x",
  "⇧ Shift": "⇧ Maj",
  "X-axis": "Axe X",
  "Y-axis": "Axe Y",
  "Z-axis": "Axe Z",
  "A-axis": "Axe A",
  "B-axis": "Axe B",
  "C-axis": "Axe C",
  "Custom Commands": "Commandes personnalisées",
  "Axes Settings": "Configuration des axes",
  "ShuttleXpress": "ShuttleXpress",
  "Feed Rate Range: {{min}} - {{max}} mm/min": "Gamme de vitesses d'usinage: {{min}} - {{max}} mm/min",
  "Repeat Rate: {{hertz}}Hz": "Vitesse de répétition: {{hertz}}Hz",
  "60 Times per Second": "60 fois par seconde",
  "45 Times per Second": "45 fois par seconde",
  "30 Times per Second": "30 fois par seconde",
  "15 Times per Second": "15 fois par seconde",
  "10 Times per Second": "10 fois par seconde",
  "5 Times per Second": "5 fois par seconde",
  "2 Times per Second": "2 fois par seconde",
  "Once Every Second": "Une fois par seconde",
  "Distance Overshoot: {{overshoot}}x": "Distance de dépassement: {{overshoot}}x",
  "Manufacturer: {{manufacturer}}": "Fabricant : {{manufacturer}}",
  "Port": "Port",
  "No ports available": "Aucun port disponible",
  "Choose a port": "Choisissez un port",
  "Refresh": "Actualiser",
  "Baud rate": "Vitesse de transmission",
  "Choose a baud rate": "Sélectionnez le taux de baud",
  "Connect automatically": "Connecter automatiquement",
  "Open": "Ouvrir",
  "Error opening serial port '{{- port}}'": "Erreur lors de l'ouverture du port série '{{- port}}'",
  "Connection": "Connexion",
  "No serial connection": "Pas de connexion série",
  "Connected to {{-port}} with a baud rate of {{baudrate}}": "Connecté à {{-port}} avec un taux de transmission de {{baudrate}}",
  "Console": "Console",
  "Clear all": "Effacer tout",
  "Select All": "Sélectionner tout",
  "Clear Selection": "Effacer la sélection",
  "URL not configured": "URL non configurée",
  "The widget is currently disabled": "Le module est actuellement désactivé",
  "Enable": "Activer",
  "Disable": "Désactiver",
  "URL": "URL",
  "Min": "Min",
  "Max": "Max",
  "Dimension": "Dimension",
  "Sent": "Envoyé",
  "Received": "Reçu",
  "Start Time": "Heure de début",
  "Elapsed Time": "Temps écoulé",
  "Finish Time": "Heure de fin",
  "Remaining Time": "Temps restant",
  "Controller State": "État du contrôleur",
  "Controller Settings": "Paramètres du contrôleur",
  "Hide": "Masquer",
  "Show": "Montrer",
  "Queue Reports": "Rapports de file d'attente",
  "Planner Buffer": "Tampon du planificateur",
  "Receive Buffer": "Tampon de réception",
  "Status Reports": "Rapports de statut",
  "State": "État",
  "Feed Rate": "Taux d'avance",
  "Spindle": "Broche",
  "Tool Number": "Numéro de l'outil",
  "Modal Groups": "Groupes modaux",
  "Motion": "Mouvement",
  "Coordinate": "Coordonnée",
  "Plane": "Plan",
  "Distance": "Distance",
  "Program": "Programme",
  "Coolant": "Refroidissement",
  "Status Report (?)": "Rapport de statut (?)",
  "Check G-code Mode ($C)": "Vérifier le mode G-code ($C)",
  "Homing ($H)": "Origines ($H)",
  "Kill Alarm Lock ($X)": "Désactiver l'alarme de verrouillage ($X)",
  "Sleep ($SLP)": "Veille ($SLP)",
  "Help ($)": "Aide ($)",
  "Settings ($$)": "Paramètres ($$)",
  "View G-code Parameters ($#)": "Afficher les paramètres G-code ($#)",
  "View G-code Parser State ($G)": "Afficher l'état du parseur G-code ($G)",
  "View Build Info ($I)": "Voir les informations de compilation ($I)",
  "View Startup Blocks ($N)": "Afficher les blocs de démarrage ($N)",
  "Laser": "Laser",
  "Laser Intensity Control": "Contrôle de l’intensité du laser",
  "Laser Test": "Test laser",
  "Power (%)": "Puissance (%)",
  "Test duration": "Durée du test",
  "ms": "ms",
  "Maximum value": "Valeur maximale",
  "Laser Off": "Laser éteint",
  "New Macro": "Nouvelle macro",
  "Macro Name": "Nom de macro",
  "Macro Commands": "Commandes de macro",
  "Macro Variables": "Variables de macro",
  "Edit Macro": "Modifier la macro",
  "Delete Macro": "Supprimer la macro",
  "Are you sure you want to delete this macro?": "Êtes-vous sûr de vouloir supprimer cette macro?",
  "No": "Non",
  "Yes": "Oui",
  "Macro": "Macro",
  "Are you sure you want to load this macro?": "Êtes-vous sûr de vouloir charger cette macro?",
  "No macros": "Pas de macros",
  "Run": "Exécuter",
  "Get Extruder Temperature (M105)": "Obtenir la température de l'extrudeuse (M105)",
  "Get Current Position (M114)": "Obtenir la position actuelle (M114)",
  "Get Firmware Version and Capabilities (M115)": "Obtenir la version du firmware et ses capacités (M115)",
  "Heater Control": "Contrôle du chauffage",
  "Extruder": "Extrudeuse",
  "°C": "°C",
  "Set the target temperature for the extruder": "Définir la température cible pour l'extrudeuse",
  "Heated Bed": "Lit chauffant",
  "Set the target temperature for the heated bed": "Définir la température cible pour le lit chauffant",
  "Extruder Temperature": "Température de l'extrudeuse",
  "Heated Bed Temperature": "Température du lit chauffant",
  "Extruder Power": "Puissance de l'extrudeuse",
  "Heated Bed Power": "Puissance du lit chauffant",
  "Probe": "Palpeur",
  "mm/min": "mm/min",
  "in/min": "po/min",
  "Probe Command": "Commande de palpage",
  "G38.2 probe toward workpiece, stop on contact, signal error if failure": "G38.2 palper vers la pièce, stopper au contact, signaler une erreur si échec",
  "G38.3 probe toward workpiece, stop on contact": "G38.3 palper vers la pièce, stopper au contact",
  "G38.4 probe away from workpiece, stop on loss of contact, signal error if failure": "G38.4 palper en s'éloignant de la pièce, stopper à la perte de contact, signaler une erreur si échec",
  "G38.5 probe away from workpiece, stop on loss of contact": "G38.5 palper en s'éloignant de la pièce, stopper à la perte de contact",
  "Probe Depth": "Profondeur de palpe",
  "Probe Feedrate": "Vitesse de palpage",
  "Touch Plate Thickness": "Épaisseur du palpeur",
  "Retraction Distance": "Distance de retrait",
  "Apply tool length offset": "Appliquer le décalage de longueur d'outil",
  "Run Probe": "Lancer le palpage",
  "Probe Axis": "Axe du palpeur",
  "Probe Z Axis": "Palpeur Axe Z",
  "Probe X Axis": "Palpeur Axe X",
  "Probe Y Axis": "Palpeur Axe Y",
  "Spindle Speed": "Vitesse de broche",
  "RPM": "tr/min",
  "Queue Flush (%)": "Vider la file d'attente (%)",
  "Kill Job (^d)": "Arrêter le travail (^d)",
  "Clear Alarm ($clear)": "Effacer l'alarme ($clear)",
  "Show System Settings": "Afficher les paramètres du système",
  "Show All Settings": "Afficher tous les paramètres",
  "List Self Tests": "Lister les auto-tests",
  "Power Management": "Gestion de l'alimentation",
  "Enable Motors": "Activer les moteurs",
  "Disable Motors": "Désactiver les moteurs",
  "Motor {{n}}": "Moteur {{n}}",
  "Velocity": "Vélocité",
  "Line": "Ligne",
  "Path": "Chemin",
  "G-code not loaded": "G-code non chargé",
  "Tool Change": "Changement d'outil",
  "Are you sure you want to resume program execution?": "Êtes-vous sûr de vouloir reprendre l'exécution du programme?",
  "Click the Resume button to resume program execution.": "Cliquez sur le bouton Reprendre pour continuer l'exécution du programme.",
  "Click the Stop button to stop program execution.": "Cliquez sur le bouton Arrêter pour interrompre l'exécution du programme.",
  "Run a tool change macro to change the tool and adjust the Z-axis offset. Afterwards, click the Resume button to resume program execution.": "Exécutez une macro de changement d'outil pour changer l'outil et ajuster le décalage de l'axe Z. Ensuite, cliquez sur le bouton Reprendre pour continuer l'exécution du programme.",
  "Waiting for the target temperature to be reached...": "En attente que la température cible soit atteinte...",
  "Work Coordinate System": "Système de coordonnées de travail",
  "Enable 3D View": "Activer la vue 3D",
  "Disable 3D View": "Désactiver la vue 3D",
  "3D View": "Vue 3D",
  "Projection": "Projection",
  "Perspective Projection": "Projection en perspective",
  "Orthographic Projection": "Projection orthographique",
  "Display G-code Filename": "Afficher le nom du fichier G-code",
  "Hide Coordinate System": "Masquer le système de coordonnées",
  "Show Coordinate System": "Afficher le système de coordonnées",
  "Hide Grid Line Numbers": "Masquer les numéros de lignes de la grille",
  "Show Grid Line Numbers": "Afficher les numéros de lignes de la grille",
  "File folder": "Dossier de fichiers",
  "{{extname}} File": "Fichier {{extname}}",
  "File": "Fichier",
  "3D rendering": "Rendu 3D",
  "Zoom In": "Zoom avant",
  "Zoom Out": "Zoom arrière",
  "Move the camera": "Déplacer la caméra",
  "Rotate the camera": "Pivoter la caméra",
  "Watch Directory": "Répertoire de surveillance",
  "Date modified": "Date de modification",
  "Type": "Type",
  "Size": "Taille",
  "Load G-code": "Charger le G-code",
  "Upload G-code": "Charger un fichier G-code",
  "Browse...": "Parcourir...",
  "Resume": "Reprendre",
  "Pause": "Pause",
  "Webcam": "Webcam",
  "Webcam Settings": "Paramètres de la webcam",
  "Media Source": "Source média",
  "Use a built-in camera or a connected webcam": "Utilisez une caméra intégrée ou une webcam connectée",
  "Webcam is off": "La webcam est éteinte",
  "Rotate Left": "Pivoter à gauche",
  "Rotate Right": "Pivoter à droite",
  "Flip Horizontally": "Retourner horizontalement",
  "Flip Vertically": "Retourner verticalement",
  "Crosshair": "Réticule",
  "Manual Data Input": "Entrée de données manuelles",
  "MDI": "MDI",
  "Button Width": "Largeur du bouton",
  "Order": "Ordre",
  "Move Up": "Déplacer vers le haut",
  "Move Down": "Déplacer vers le bas",
  "Remove": "Supprimer",
  "Waiting for the planner to empty...": "En attente que le planificateur se vide...",
  "No video devices available": "Aucun périphérique vidéo disponible",
  "Choose a video device": "Choisissez un périphérique vidéo",
  "Automatic detection": "Détection automatique",
  "Front View": "Vue de face",
  "Move Backward": "Reculer",
  "Move Forward": "Avancer",
  "Top View": "Vue de dessus",
  "Zoom to Fit": "Ajuster le zoom",
  "Right Side View": "Vue côté droit",
  "Left Side View": "Vue côté gauche",
  "Custom range...": "Intervalle personnalisé...",
  "Today": "Aujourd'hui",
  "Last {{n}} days": "{{n}} derniers jours",
  "Apply": "Appliquer",
  "Add": "Ajouter",
  "Custom Jog Distance (mm)": "Distance de déplacement personnalisée (mm)",
  "Custom Jog Distance (inches)": "Distance de déplacement personnalisée (pouces)",
  "Machine Profiles": "Profils de machine",
  "No machine profile selected": "Aucun profil de machine sélectionné",
  "Delete machine profile": "Supprimer le profil de machine",
  "Machine Profile": "Profil de la machine",
  "Limits": "Limites",
  "User Accounts": "Comptes utilisateurs",
  "New Account": "Nouveau compte",
  "Hide Limits": "Masquer les limites",
  "Show Limits": "Afficher les limites",
  "WebGL: <1>Enabled</1>": "WebGL : <1>Activé</1>",
  "WebGL: <1>Disabled</1>": "WebGL : <1>Désactivé</1>",
  "Hide Cutting Tool": "Masquer l'outil de coupe",
  "Show Cutting Tool": "Afficher l'outil de coupe",
  "Ready to start": "Prêt à démarrer",
  "Connect to an IP camera": "Se connecter à une caméra IP",
  "The URL should point to a stream in one of the following formats: Motion JPEG (mjpeg), RTSP, or H264 (MP4).": "L'URL doit pointer vers un flux dans l'un des formats suivants : Motion JPEG (mjpeg), RTSP ou H264 (MP4).",
  "Set DTR line status upon opening": "Définir l'état de la ligne DTR à l'ouverture",
  "SET": "ÉTABLIR",
  "CLR": "CLR",
  "Set RTS line status upon opening": "Définir l'état de la ligne RTS à l'ouverture",
  "Use RTS/CTS flow control": "Utiliser le contrôle de flux RTS/CTS",
  "Data Collection": "Collecte de données",
  "Enable anonymous usage data collection": "Activer la collecte anonyme des données d'utilisation",
  "Display language:": "Langue d'affichage :"
}
