{
    "Records: {{from}} - {{to}} / {{total}}": "Registros: {{from}} - {{to}} / {{total}}",
    "Records: {{total}}": "Registros: {{total}}",
    "{{pageLength}} per page": "{{pageLength}} por página",
    "New update available": "Nova atualização disponível",
    "Command succeeded": "Comando executado",
    "Command failed ({{err}})": "Comando falhou ({{err}})",
    "My Account": "Minha Conta",
    "Signed in as {{name}}": "Entrou como {{name}}",
    "Account": "Conta",
    "Sign Out": "Sair",
    "Options": "Opções",
    "Command": "Comando",
    "Show notifications": "Mostrar notificações",
    "Help": "Ajuda",
    "Report an issue": "Comunicar um problema",
    "Cycle Start": "Iniciar Ciclo",
    "Feedhold": "Pausar",
    "Homing": "Origem",
    "Sleep": "Suspender",
    "Unlock": "Desbloquear",
    "Reset": "Reiniciar",
    "Authentication failed.": "Autenticação falhou",
    "Error": "Erro",
    "Sign in to {{name}}": "Entrar como {{name}}",
    "Username": "Nome de Utilizador",
    "Password": "Palavra-Passe",
    "Sign In": "Entrar",
    "Forgot your password?": "Esqueceu a sua Palavra-Passe?",
    "A web-based interface for CNC milling controller running Grbl, Smoothieware, or TinyG": "Uma interface baseada na web para controlador de fresagem CNC executando Grbl, Smoothieware ou TinyG",
    "Learn more": "Saiba mais",
    "Downloads": "Downloads",
    "Checking for updates...": "Verificando se há atualizações...",
    "A new version of {{name}} is available": "Uma nova versão do {{name}} está disponível",
    "Version {{version}}": "Versão {{version}}",
    "Latest version": "Versão mais recente",
    "You already have the newest version of {{name}}": "Você já possui a versão mais recente do {{name}}",
    "New": "Novo",
    "Account status": "Estado de conta",
    "Name": "Nome",
    "Confirm Password": "Confirmar Palavra-Passe",
    "Cancel": "Cancelar",
    "OK": "OK",
    "An unexpected error has occurred.": "Ocorreu um erro inesperado.",
    "Loading...": "A Carregar...",
    "No data to display": "Sem dados para exibir",
    "Enabled": "Ativado",
    "Disabled": "Desativado",
    "Date Modified": "Data modificada",
    "Action": "Ação",
    "Edit Account": "Editar Conta",
    "Delete Account": "Apagar Conta",
    "Settings": "Configurações",
    "Are you sure you want to delete the account?": "Tem certeza de que deseja apagar a conta?",
    "Update": "Atualizar",
    "Old Password": "Palavra-Passe Atual",
    "Change Password": "Alterar Palavra-Passe",
    "New Password": "Nova Palavra-Passe",
    "Commands": "Comandos",
    "Title": "Título",
    "and more...": "e mais...",
    "Delete": "Apagar",
    "Are you sure you want to delete this item?": "Tem certeza de que deseja apagar este ítem?",
    "Exception": "Exceção",
    "Continue execution when an error is detected in the G-code program": "Continuar a execução quando um erro é detectado no G-code",
    "Enabling this option may cause machine damage if you don't have an Emergency Stop button to prevent a dangerous situation.": "A ativação desta opção pode causar danos à máquina se você não tiver um botão de paragem de emergência para evitar uma situação perigosa.",
    "Save Changes": "Salvar alterações",
    "Events": "Eventos",
    "Event": "Evento",
    "Choose an event": "Escolha um evento",
    "Startup (System only)": "Iniciar (somente o sistema)",
    "Open a serial port (System only)": "Abrir uma porta série (somente o sistema)",
    "Close a serial port (System only)": "Fechar uma porta série (somente o sistema)",
    "G-code: Load": "G-code: Carregar",
    "G-code: Unload": "G-code: Descarregar",
    "G-code: Start": "G-code: Iniciar",
    "G-code: Stop": "G-code: Parar",
    "G-code: Pause": "G-code: Pausar",
    "G-code: Resume": "G-code: Continuar",
    "Feed Hold": "Mantém Avanço",
    "Run Macro": "Executar uma macro",
    "Load Macro": "Carregar Macro",
    "Trigger": "Gatilho",
    "Choose an trigger": "Escolha um gatilho",
    "System": "Sistema",
    "G-code": "G-code",
    "Automatically check for updates": "Verificar automáticamente as atualizações",
    "Language": "Idioma",
    "General": "Geral",
    "Workspace": "Área de Trabalho",
    "Controller": "Controlador",
    "About": "Sobre",
    "The account name is already being used. Choose another name.": "O nome da conta já está em utilização. Escolha outro nome.",
    "Passwords do not match.": "As palavras-passe não coincidem.",
    "Import": "Importar",
    "Are you sure you want to overwrite the workspace settings?": "Tem certeza de que deseja substituir as configurações da área de trabalho?",
    "Restore Defaults": "Restaurar Padrões",
    "Are you sure you want to restore the default settings?": "Você tem certeza que deseja restaurar a configuração padrão?",
    "Import Error": "Erro de Importação",
    "Invalid file format.": "Formato de arquivo inválido.",
    "Close": "Fechar",
    "Export": "Exportar",
    "Click the Continue button to resume execution.": "Clique no botão Continuar para continuar a execução.",
    "Stop": "Parar",
    "Continue": "Contituar",
    "Server has stopped working": "O servidor parou de funcionar",
    "A problem caused the server to stop working correctly. Check out the server status and try again.": "Um problema fez com que o servidor deixasse de funcionar corretamente. Confira o estado do servidor e tente novamente.",
    "Reload": "Recarregar",
    "Fork Widget": "Copiar Módulo",
    "Are you sure you want to fork this widget?": "Tem certeza de que deseja copiar esse módulo?",
    "Remove Widget": "Remover Módulo",
    "Are you sure you want to remove this widget?": "Tem certeza de que deseja remover esse módulo?",
    "On": "Ativado",
    "Off": "Desativado",
    "Visualizer Widget": "Módulo Visualizar",
    "This widget visualizes a G-code file and simulates the tool path.": "Este Módulo visualiza um arquivo G-code e simula a trajetória da ferramenta.",
    "Connection Widget": "Módulo Conexão",
    "This widget lets you establish a connection to a serial port.": "Este Módulo permite estabelecer uma conexão com uma porta série.",
    "Console Widget": "Módulo Console",
    "This widget lets you read and write data to the CNC controller connected to a serial port.": "Este Módulo permite ler e gravar dados para o controlador CNC conectado a uma porta série.",
    "Grbl Widget": "Módulo Grbl",
    "This widget shows the Grbl state and provides Grbl specific features.": "Este Módulo mostra o estado do Grbl e fornece características específicas do Grbl.",
    "Marlin Widget": "Módulo Marlin",
    "This widget shows the Marlin state and provides Marlin specific features.": "Este Módulo mostra o estado do Marlin e fornece características específicas do Marlin.",
    "Smoothie Widget": "Módulo Smoothie",
    "This widget shows the Smoothie state and provides Smoothie specific features.": "Este Módulo mostra o estado do Smoothie e fornece características específicas do Smoothie.",
    "TinyG Widget": "Módulo TinyG",
    "This widget shows the TinyG state and provides TinyG specific features.": "Este Módulo mostra o estado do TinyG e fornece características específicas do TinyG.",
    "Axes Widget": "Módulo Eixos",
    "This widget shows the XYZ position. It includes jog controls, homing, and axis zeroing.": "Este Módulo mostra a posição XYZ. Ele inclui controles de movimento, homing e zeragem de eixo.",
    "G-code Widget": "Módulo G-code",
    "This widget shows the current status of G-code commands.": "Este Módulo mostra o estado atual dos comandos G-code.",
    "Laser Widget": "Módulo Laser",
    "This widget allows you control laser intensity and turn the laser on/off.": "Este módulo permite ativar/desativar e controlar a intensidade do laser.",
    "Macro Widget": "Módulo Macro",
    "This widget can use macros to automate routine tasks.": "Este Módulo pode usar macros para automatizar tarefas de rotina.",
    "Probe Widget": "Módulo Ajuste de Referência",
    "This widget helps you use a touch plate to set your Z zero offset.": "Este Módulo ajuda a usar uma placa de toque para definir o offset para zerar o Z.",
    "Spindle Widget": "Módulo Spindle",
    "This widget provides the spindle control.": "Este Módulo fornece o controle do spindle.",
    "Custom Widget": "Módulo Personalizado",
    "This widget gives you a communication interface for creating your own widget.": "Este módulo oferece uma interface de comunicação para criar seu próprio módulo.",
    "Webcam Widget": "Módulo Webcam",
    "This widget lets you monitor a webcam.": "Este Módulo permite que você monitore uma webcam.",
    "Widgets": "Módulos",
    "M0 Program Pause": "M0 Pausa o Programa",
    "M1 Program Pause": "M1 Pausa o Programa",
    "M2 Program End": "M2 Finaliza o Programa",
    "M30 Program End": "M30 Finaliza o Programa",
    "M6 Tool Change": "M6 Troca de Ferramenta",
    "M109 Set Extruder Temperature": "M109 Ajustar a Temperatura da Extrusora",
    "M190 Set Heated Bed Temperature": "M190 Ajustar a temperatura da cama aquecida",
    "Drop G-code file here": "Solte o arquivo G-code aqui",
    "Manage Widgets ({{inactiveCount}})": "Gerir Módulos ({{inactiveCount}})",
    "Collapse All": "Colapsar Todos",
    "Expand All": "Expandir Todos",
    "Corrupted workspace settings": "Configurações de área de trabalho corrompidas",
    "The workspace settings have become corrupted or invalid. Click Restore Defaults to restore default settings and continue.": "As configurações da área de trabalho ficaram corrompidas ou inválidas. Clique em Restaurar padrões para restaurar as configurações padrão e continuar.",
    "Download workspace settings": "Descarregar configurações da área de trabalho",
    "This field is required.": "Este campo é obrigatório.",
    "Passwords should be equal.": "As palavras-passe devem ser iguais.",
    "Work Coordinate System (G54)": "Sistema de Coordenadas de Trabalho (G54)",
    "Work Coordinate System (G55)": "Sistema de Coordenadas de Trabalho (G55)",
    "Work Coordinate System (G56)": "Sistema de Coordenadas de Trabalho (G56)",
    "Work Coordinate System (G57)": "Sistema de Coordenadas de Trabalho (G57)",
    "Work Coordinate System (G58)": "Sistema de Coordenadas de Trabalho (G58)",
    "Work Coordinate System (G59)": "Sistema de Coordenadas de Trabalho (G59)",
    "Go To Work Zero (G0 X0 Y0 Z0)": "Vai ao Zero de Trabalho (G0 X0 Y0 Z0)",
    "Zero Out Work Offsets (G10 L20 P1 X0 Y0 Z0)": "Definir como Zero de Trabalho (G10 L20 P1 X0 Y0 Z0)",
    "Zero Out Work Offsets (G10 L20 P2 X0 Y0 Z0)": "Definir como Zero de Trabalho (G10 L20 P2 X0 Y0 Z0)",
    "Zero Out Work Offsets (G10 L20 P3 X0 Y0 Z0)": "Definir como Zero de Trabalho (G10 L20 P3 X0 Y0 Z0)",
    "Zero Out Work Offsets (G10 L20 P4 X0 Y0 Z0)": "Definir como Zero de Trabalho (G10 L20 P4 X0 Y0 Z0)",
    "Zero Out Work Offsets (G10 L20 P5 X0 Y0 Z0)": "Definir como Zero de Trabalho (G10 L20 P5 X0 Y0 Z0)",
    "Zero Out Work Offsets (G10 L20 P6 X0 Y0 Z0)": "Definir como Zero de Trabalho (G10 L20 P6 X0 Y0 Z0)",
    "Temporary Offsets (G92)": "Offsets Temporários (G92)",
    "Zero Out Temporary Offsets (G92 X0 Y0 Z0)": "Define o Zero Temporário (G92 X0 Y0 Z0)",
    "Un-Zero Out Temporary Offsets (G92.1 X0 Y0 Z0)": "Remove o Zero Temporário (G92.1 X0 Y0 Z0)",
    "Machine Coordinate System (G53)": "Sistema de Coordenadas da Máquina (G53)",
    "Go To Machine Zero (G53 G0 X0 Y0 Z0)": "Vai ao Zero da Máquina (G53 G0 X0 Y0 Z0)",
    "Set Machine Zero (G28.3 X0 Y0 Z0)": "Define o Zero da Máquina (G28.3 X0 Y0 Z0)",
    "Homing Sequence (G28.2 X0 Y0 Z0)": "Sequência para Origem (G28.2 X0 Y0 Z0)",
    "Go To Work Zero On X Axis (G0 X0)": "Vai para o Zero do Eixo X de Trabalho (G0 X0)",
    "Zero Out Work X Axis (G10 L20 P1 X0)": "Zera o Eixo X de Trabalho (G10 L20 P1 X0)",
    "Zero Out Work X Axis (G10 L20 P2 X0)": "Zera o Eixo X de Trabalho (G10 L20 P2 X0)",
    "Zero Out Work X Axis (G10 L20 P3 X0)": "Zera o Eixo X de Trabalho (G10 L20 P3 X0)",
    "Zero Out Work X Axis (G10 L20 P4 X0)": "Zera o Eixo X de Trabalho (G10 L20 P4 X0)",
    "Zero Out Work X Axis (G10 L20 P5 X0)": "Zera o Eixo X de Trabalho (G10 L20 P5 X0)",
    "Zero Out Work X Axis (G10 L20 P6 X0)": "Zera o Eixo X de Trabalho (G10 L20 P6 X0)",
    "Zero Out Temporary X Axis (G92 X0)": "Define o Zero Temporário do Eixo X (G92 X0)",
    "Un-Zero Out Temporary X Axis (G92.1 X0)": "Remove o Zero Temporário do Eixo X (G92.1 X0)",
    "Go To Machine Zero On X Axis (G53 G0 X0)": "Vai para o Zero do Eixo X da Máquina (G53 G0 X0)",
    "Zero Out Machine X Axis (G28.3 X0)": "Define o Zero do Eixo X da Máquina (G28.3 X0)",
    "Home Machine X Axis (G28.2 X0)": "Origem do Eixo X da Máquina (G28.2 X0)",
    "Go To Work Zero On Y Axis (G0 Y0)": "Vai para o Zero do Eixo Y de Trabalho (G0 Y0)",
    "Zero Out Work Y Axis (G10 L20 P1 Y0)": "Zera o Eixo Y de Trabalho (G10 L20 P1 Y0)",
    "Zero Out Work Y Axis (G10 L20 P2 Y0)": "Zera o Eixo Y de Trabalho (G10 L20 P2 Y0)",
    "Zero Out Work Y Axis (G10 L20 P3 Y0)": "Zera o Eixo Y de Trabalho (G10 L20 P3 Y0)",
    "Zero Out Work Y Axis (G10 L20 P4 Y0)": "Zera o Eixo Y de Trabalho (G10 L20 P4 Y0)",
    "Zero Out Work Y Axis (G10 L20 P5 Y0)": "Zera o Eixo Y de Trabalho (G10 L20 P5 Y0)",
    "Zero Out Work Y Axis (G10 L20 P6 Y0)": "Zera o Eixo Y de Trabalho (G10 L20 P6 Y0)",
    "Zero Out Temporary Y Axis (G92 Y0)": "Define o Zero Temporário do Eixo Y (G92 Y0)",
    "Un-Zero Out Temporary Y Axis (G92.1 Y0)": "Remove o Zero Temporário do Eixo Y (G92.1 Y0)",
    "Go To Machine Zero On Y Axis (G53 G0 Y0)": "Vai para o Zero do Eixo Y da Máquina (G53 G0 Y0)",
    "Zero Out Machine Y Axis (G28.3 Y0)": "Define o Zero do Eixo Y da Máquina (G28.3 Y0)",
    "Home Machine Y Axis (G28.2 Y0)": "Origem do Eixo Y da Máquina (G28.2 Y0)",
    "Go To Work Zero On Z Axis (G0 Z0)": "Vai para o Zero do Eixo Z de Trabalho (G0 Z0)",
    "Zero Out Work Z Axis (G10 L20 P1 Z0)": "Zera o Eixo Z de Trabalho (G10 L20 P1 Z0)",
    "Zero Out Work Z Axis (G10 L20 P2 Z0)": "Zera o Eixo Z de Trabalho (G10 L20 P2 Z0)",
    "Zero Out Work Z Axis (G10 L20 P3 Z0)": "Zera o Eixo Z de Trabalho (G10 L20 P3 Z0)",
    "Zero Out Work Z Axis (G10 L20 P4 Z0)": "Zera o Eixo Z de Trabalho (G10 L20 P4 Z0)",
    "Zero Out Work Z Axis (G10 L20 P5 Z0)": "Zera o Eixo Z de Trabalho (G10 L20 P5 Z0)",
    "Zero Out Work Z Axis (G10 L20 P6 Z0)": "Zera o Eixo Z de Trabalho (G10 L20 P6 Z0)",
    "Zero Out Temporary Z Axis (G92 Z0)": "Define o Zero Temporário do Eixo Z (G92 Z0)",
    "Un-Zero Out Temporary Z Axis (G92.1 Z0)": "Remove o Zero Temporário do Eixo Z (G92.1 Z0)",
    "Go To Machine Zero On Z Axis (G53 G0 Z0)": "Vai para o Zero do Eixo Z da Máquina (G53 G0 Z0)",
    "Zero Out Machine Z Axis (G28.3 Z0)": "Define o Zero do Eixo Z da Máquina (G28.3 Z0)",
    "Home Machine Z Axis (G28.2 Z0)": "Origem do Eixo Z da Máquina (G28.2 Z0)",
    "Go To Work Zero On A Axis (G0 A0)": "Vai para o Zero do Eixo A de Trabalho (G0 A0)",
    "Zero Out Work A Axis (G10 L20 P1 A0)": "Zera o Eixo A de Trabalho (G10 L20 P1 A0)",
    "Zero Out Work A Axis (G10 L20 P2 A0)": "Zera o Eixo A de Trabalho (G10 L20 P2 A0)",
    "Zero Out Work A Axis (G10 L20 P3 A0)": "Zera o Eixo A de Trabalho (G10 L20 P3 A0)",
    "Zero Out Work A Axis (G10 L20 P4 A0)": "Zera o Eixo A de Trabalho (G10 L20 P4 A0)",
    "Zero Out Work A Axis (G10 L20 P5 A0)": "Zera o Eixo A de Trabalho (G10 L20 P5 A0)",
    "Zero Out Work A Axis (G10 L20 P6 A0)": "Zera o Eixo A de Trabalho (G10 L20 P6 A0)",
    "Zero Out Temporary A Axis (G92 A0)": "Define o Zero Temporário do Eixo A (G92 A0)",
    "Un-Zero Out Temporary A Axis (G92.1 A0)": "Remove o Zero Temporário do Eixo A (G92.1 A0)",
    "Go To Machine Zero On A Axis (G53 G0 A0)": "Vai para o Zero do Eixo A da Máquina (G53 G0 A0)",
    "Zero Out Machine A Axis (G28.3 A0)": "Define o Zero do Eixo A da Máquina (G28.3 A0)",
    "Home Machine A Axis (G28.2 A0)": "Origem do Eixo A da Máquina (G28.2 A0)",
    "Go To Work Zero On B Axis (G0 B0)": "Vai para o Zero do Eixo B de Trabalho (G0 B0)",
    "Zero Out Work B Axis (G10 L20 P1 B0)": "Zera o Eixo B de Trabalho (G10 L20 P1 B0)",
    "Zero Out Work B Axis (G10 L20 P2 B0)": "Zera o Eixo B de Trabalho (G10 L20 P2 B0)",
    "Zero Out Work B Axis (G10 L20 P3 B0)": "Zera o Eixo B de Trabalho (G10 L20 P3 B0)",
    "Zero Out Work B Axis (G10 L20 P4 B0)": "Zera o Eixo B de Trabalho (G10 L20 P4 B0)",
    "Zero Out Work B Axis (G10 L20 P5 B0)": "Zera o Eixo B de Trabalho (G10 L20 P5 B0)",
    "Zero Out Work B Axis (G10 L20 P6 B0)": "Zera o Eixo B de Trabalho (G10 L20 P6 B0)",
    "Zero Out Temporary B Axis (G92 B0)": "Define o Zero Temporário do Eixo B (G92 B0)",
    "Un-Zero Out Temporary B Axis (G92.1 B0)": "Remove o Zero Temporário do Eixo B (G92.1 B0)",
    "Go To Machine Zero On B Axis (G53 G0 B0)": "Vai para o Zero do Eixo B da Máquina (G53 G0 B0)",
    "Zero Out Machine B Axis (G28.3 B0)": "Define o Zero do Eixo B da Máquina (G28.3 B0)",
    "Home Machine B Axis (G28.2 B0)": "Origem do Eixo B da Máquina (G28.2 B0)",
    "Go To Work Zero On C Axis (G0 C0)": "Vai para o Zero do Eixo C de Trabalho (G0 C0)",
    "Zero Out Work C Axis (G10 L20 P1 C0)": "Zera o Eixo C de Trabalho (G10 L20 P1 C0)",
    "Zero Out Work C Axis (G10 L20 P2 C0)": "Zera o Eixo C de Trabalho (G10 L20 P2 C0)",
    "Zero Out Work C Axis (G10 L20 P3 C0)": "Zera o Eixo C de Trabalho (G10 L20 P3 C0)",
    "Zero Out Work C Axis (G10 L20 P4 C0)": "Zera o Eixo C de Trabalho (G10 L20 P4 C0)",
    "Zero Out Work C Axis (G10 L20 P5 C0)": "Zera o Eixo C de Trabalho (G10 L20 P5 C0)",
    "Zero Out Work C Axis (G10 L20 P6 C0)": "Zera o Eixo C de Trabalho (G10 L20 P6 C0)",
    "Zero Out Temporary C Axis (G92 C0)": "Define o Zero Temporário do Eixo C (G92 C0)",
    "Un-Zero Out Temporary C Axis (G92.1 C0)": "Remove o Zero Temporário do Eixo C (G92.1 C0)",
    "Go To Machine Zero On C Axis (G53 G0 C0)": "Vai para o Zero do Eixo C da Máquina (G53 G0 C0)",
    "Zero Out Machine C Axis (G28.3 C0)": "Define o Zero do Eixo C da Máquina (G28.3 C0)",
    "Home Machine C Axis (G28.2 C0)": "Origem do Eixo C da Máquina (G28.2 C0)",
    "mm": "mm",
    "in": "in",
    "deg": "deg",
    "Zero Out Machine": "Define o Zero da Máquina",
    "Home Machine": "Origem da Máquina",
    "Zero Out Work Offsets": "",
    "Set Work Offsets": "Define deslocamento de Trabalho",
    "Axis": "Eixo",
    "Machine Position": "Posição da Máquina",
    "Work Position": "Posição de Trabalho",
    "Axes": "Eixos",
    "Keypad jogging": "",
    "Edit": "Editar",
    "Expand": "Expandir",
    "Collapse": "Colapsar",
    "More": "Mais",
    "Enter Full Screen": "Mostrar em modo ecrã inteiro",
    "Exit Full Screen": "Sair de modo ecrã inteiro",
    "Move X- Y+": "Move X- Y+",
    "Move Y+": "Move Y+",
    "Move X+ Y+": "Move X+ Y+",
    "Move Z+": "Move Z+",
    "Move X-": "Move X-",
    "Move To XY Zero (G0 X0 Y0)": "Move para XY Zero (G0 X0 Y0)",
    "Move X+": "Move X+",
    "Move To Z Zero (G0 Z0)": "Move para Z Zero (G0 Z0)",
    "Move X- Y-": "Move X- Y-",
    "Move Y-": "Move Y-",
    "Move X+ Y-": "Move X+ Y-",
    "Move Z-": "Move Z-",
    "Units": "Unidades",
    "G20 (inch)": "G20 (polegada)",
    "G21 (mm)": "G21 (mm)",
    "Imperial": "Imperial",
    "Metric": "Métrico",
    "Right": "Direita",
    "Left": "Esquerda",
    "Up": "Acima",
    "Down": "Abaixo",
    "Page Up": "Página acima",
    "Page Down": "Página abaixo",
    "Right Square Bracket": "Suporte quadrado direito",
    "Left Square Bracket": "Suporte quadrado esquerdo",
    "0.1x Move": "Move 0,1x",
    "Alt": "Alt",
    "10x Move": "Move 10x",
    "⇧ Shift": "⇧ Muda",
    "X-axis": "Eixo X",
    "Y-axis": "Eixo Y",
    "Z-axis": "Eixo Z",
    "A-axis": "Eixo A",
    "B-axis": "Eixo B",
    "C-axis": "Eixo C",
    "Custom Commands": "Comandos Personalizados",
    "Axes Settings": "Configurações de eixos",
    "ShuttleXpress": "",
    "Feed Rate Range: {{min}} - {{max}} mm/min": "Intervalo de Velocidade de Maquinação: {{min}} - {{max}} mm/min",
    "Repeat Rate: {{hertz}}Hz": "Taxa de repetição: {{hertz}}Hz",
    "60 Times per Second": "60 vezes por segundo",
    "45 Times per Second": "45 vezes por segundo",
    "30 Times per Second": "30 vezes por segundo",
    "15 Times per Second": "15 vezes por segundo",
    "10 Times per Second": "10 vezes por segundo",
    "5 Times per Second": "5 vezes por segundo",
    "2 Times per Second": "2 vezes por segundo",
    "Once Every Second": "Uma vez por segundo",
    "Distance Overshoot: {{overshoot}}x": "Distância de Ultrapassagem: {{overshoot}}x",
    "Manufacturer: {{manufacturer}}": "Fabricante: {{fabricante}}",
    "Port": "Porta",
    "No ports available": "Não há portas disponíveis",
    "Choose a port": "Escolha uma porta",
    "Refresh": "Atualizar",
    "Baud rate": "Taxa de transmissão",
    "Choose a baud rate": "Escolha uma taxa de transmissão (baud rate)",
    "Enable hardware flow control": "Ativar controle de fluxo de hardware",
    "Connect automatically": "Conectar automaticamente",
    "Open": "Abrir",
    "Error opening serial port '{{- port}}'": "Erro ao abrir porta série '{{- port}}'",
    "Connection": "Conexão",
    "No serial connection": "Nenhuma conexão série",
    "Connected to {{-port}} with a baud rate of {{baudrate}}": "Conectado à porta {{-port}} com taxa de transferência de {{baudrate}}",
    "Console": "Consola",
    "Clear all": "Limpar tudo",
    "Select All": "Selecionar Tudo",
    "Clear Selection": "Limpar Seleção",
    "URL not configured": "URL não configurada",
    "The widget is currently disabled": "O módulo está desabilitado",
    "Enable": "Habilitar",
    "Disable": "Desabilitar",
    "URL": "URL",
    "Min": "Min",
    "Max": "Max",
    "Dimension": "Dimensão",
    "Sent": "Enviado",
    "Received": "Recebido",
    "Start Time": "Tempo inicial",
    "Elapsed Time": "Tempo decorrido",
    "Finish Time": "Tempo final",
    "Remaining Time": "Tempo restante",
    "Controller State": "Estado do Controlador",
    "Controller Settings": "Configurações do Controlador",
    "Hide": "Esconder",
    "Show": "Mostrar",
    "Queue Reports": "Relatórios de fila",
    "Planner Buffer": "",
    "Receive Buffer": "",
    "Status Reports": "Relatórios de estado",
    "State": "Estado",
    "Feed Rate": "Velocidade de maquinação",
    "Spindle": "Spindle",
    "Tool Number": "Número da ferramenta",
    "Modal Groups": "Grupos modais",
    "Motion": "Movimento",
    "Coordinate": "Coordenada",
    "Plane": "Plano",
    "Distance": "Distância",
    "Program": "Programa",
    "Coolant": "Refrigerante",
    "Status Report (?)": "Relatório de estado (?)",
    "Check G-code Mode ($C)": "Modo Verificar G-code ($C)",
    "Homing ($H)": "Origem ($H)",
    "Kill Alarm Lock ($X)": "Desativar o Alarme de Bloqueio ($X)",
    "Sleep ($SLP)": "Suspender ($SLP)",
    "Help ($)": "Ajuda ($)",
    "Settings ($$)": "Configurações ($$)",
    "View G-code Parameters ($#)": "Ver Parâmetros G-code ($#)",
    "View G-code Parser State ($G)": "Ver o estado do Analisador G-code ($G)",
    "View Build Info ($I)": "Ver Informações de Compilação ($I)",
    "View Startup Blocks ($N)": "Ver Blocos de Inicialização ($N)",
    "Laser": "Laser",
    "Laser Intensity Control": "Controle de Intensidade do Laser",
    "Laser Test": "Testar Laser",
    "Power (%)": "Potência (%)",
    "Test duration": "Duração do teste",
    "ms": "ms",
    "Maximum value": "Valor máximo",
    "Laser Off": "Desligar Laser",
    "New Macro": "Nova Macro",
    "Macro Name": "Nome da macro",
    "Macro Commands": "Comandos da Macro",
    "Macro Variables": "Variáveis da Macro",
    "Edit Macro": "Editar uma macro",
    "Delete Macro": "Apagar uma macro",
    "Are you sure you want to delete this macro?": "Tem certeza de que deseja excluir esta macro?",
    "No": "Não",
    "Yes": "Sim",
    "Macro": "Macro",
    "Are you sure you want to load this macro?": "Tem certeza de que deseja carregar essa macro?",
    "No macros": "Sem macros",
    "Run": "Executar",
    "Get Extruder Temperature (M105)": "Obter a temperatura da extrusora (M105)",
    "Get Current Position (M114)": "Obter a posição atual (M114)",
    "Get Firmware Version and Capabilities (M115)": "Obter versão e capacidades de firmware (M115)",
    "Heater Control": "Controle do aquecedor",
    "Extruder": "Extrusora",
    "°C": "°C",
    "Set the target temperature for the extruder": "Defina a temperatura desejada para a extrusora",
    "Heated Bed": "Cama aquecida",
    "Set the target temperature for the heated bed": "Defina a temperatura desejada para a cama aquecida",
    "Extruder Temperature": "Temperatura da extrusora",
    "Heated Bed Temperature": "Temperatura da cama aquecida",
    "Extruder Power": "Potência da Extrusora",
    "Heated Bed Power": "Potência da Cama Aquecida",
    "Probe": "Referenciamento e Nivelamento",
    "mm/min": "mm/min",
    "in/min": "in/min",
    "Probe Command": "Comando para Referenciamento",
    "G38.2 probe toward workpiece, stop on contact, signal error if failure": "G38.2 avança na direção da placa de toque, pára no contato, sinal de erro se falhar",
    "G38.3 probe toward workpiece, stop on contact": "G38.3 avança na direção da placa de toque, pára no contato",
    "G38.4 probe away from workpiece, stop on loss of contact, signal error if failure": "G38.4 distancia-se da placa de toque, pára na perda de contato, sinal de erro se falhar",
    "G38.5 probe away from workpiece, stop on loss of contact": "G38.5 distancia-se da placa de toque, pára na perda de contato",
    "Probe Depth": "Profundidade",
    "Probe Feedrate": "Velocidade da Sonda",
    "Touch Plate Thickness": "Espessura da placa de toque",
    "Retraction Distance": "Distância de retração",
    "Apply tool length offset": "Aplicar offset de comprimento da ferramenta",
    "Run Probe": "Executar o referenciamento",
    "Probe Axis": "Sensor Eixo",
    "Probe Z Axis": "Sensor Eixo Z",
    "Probe X Axis": "Sensor Eixo X",
    "Probe Y Axis": "Sensor Eixo Y",
    "Spindle Speed": "Velocidade do Spindle",
    "RPM": "RPM",
    "Queue Flush (%)": "Fluxo da fila (%)",
    "Kill Job (^d)": "Matar Trabalho (^d)",
    "Clear Alarm ($clear)": "Limpar Alarme ($clear)",
    "Show System Settings": "Mostrar configurações do sistema",
    "Show All Settings": "Mostrar todas as configurações",
    "List Self Tests": "Listar autotestes",
    "Power Management": "Gerenciamento de energia",
    "Enable Motors": "Habilitar Motores",
    "Disable Motors": "Desabilitar Motores",
    "Motor {{n}}": "Motor {{n}}",
    "Velocity": "Velocidade",
    "Line": "Linha",
    "Path": "Trajetória",
    "G-code not loaded": "G-code não carregado",
    "Tool Change": "Troca de Ferramenta",
    "Are you sure you want to resume program execution?": "Tem certeza de que deseja retomar a execução do programa?",
    "Click the Resume button to resume program execution.": "Clique no botão Continuar para retomar a execução do programa.",
    "Click the Stop button to stop program execution.": "Clique no botão Parar para parar a execução do programa.",
    "Run a tool change macro to change the tool and adjust the Z-axis offset. Afterwards, click the Resume button to resume program execution.": "Execute uma macro de mudança de ferramenta para alterar a ferramenta e ajuste o deslocamento do eixo Z. Depois, clique no botão Continuar para retomar a execução do programa.",
    "Waiting for the target temperature to be reached...": "Esperando que a temperatura desejada seja alcançada ...",
    "Work Coordinate System": "Sistema de Coordenadas de Trabalho",
    "Enable 3D View": "Habilitar Visão 3D",
    "Disable 3D View": "Desabilitar Visão 3D",
    "3D View": "Visão 3D",
    "Projection": "Projeção",
    "Perspective Projection": "Projeção de Perspectiva",
    "Orthographic Projection": "Projeção ortográfica",
    "Display G-code Filename": "Exibir o nome do arquivo G-code",
    "Hide Coordinate System": "Ocultar sistema de coordenadas",
    "Show Coordinate System": "Mostrar sistema de coordenadas",
    "Hide Grid Line Numbers": "Ocultar números de linha da grelha",
    "Show Grid Line Numbers": "Mostrar números de linha da grelha",
    "File folder": "Pasta de arquivos",
    "{{extname}} File": "Arquivo {{extname}}",
    "File": "Arquivo",
    "3D rendering": "Renderização 3D",
    "Zoom In": "Zoom +",
    "Zoom Out": "Zoom -",
    "Move the camera": "Move a câmera",
    "Rotate the camera": "Rotaciona a câmera",
    "Watch Directory": "Ver Diretório",
    "Date modified": "Data de modificação",
    "Type": "Tipo",
    "Size": "Tamanho",
    "Load G-code": "Carregar G-code",
    "Upload G-code": "Abrir um arquivo G-code",
    "Browse...": "Procurar...",
    "Resume": "Continuar",
    "Pause": "Pausar",
    "Webcam": "Webcam",
    "Webcam Settings": "Configurações da Webcam",
    "Media Source": "Fonte da Media",
    "Use a built-in camera or a connected webcam": "Use uma câmera embutida ou uma webcam conectada",
    "Webcam is off": "Webcam desligada",
    "Rotate Left": "Virar à esquerda",
    "Rotate Right": "Virar à direita",
    "Flip Horizontally": "Inverte horizontalmente",
    "Flip Vertically": "Inverte verticalmente",
    "Crosshair": "Mira",
    "Manual Data Input": "Entrada manual de dados",
    "MDI": "MDI",
    "Button Width": "Largura do botão",
    "Order": "Ordem",
    "Move Up": "Sobe",
    "Move Down": "Desce",
    "Remove": "Remover",
    "Waiting for the planner to empty...": "Esperando o planejador esvaziar ...",
    "No video devices available": "Não há dispositivos de vídeo disponíveis",
    "Choose a video device": "Escolha um dispositivo de vídeo",
    "Automatic detection": "Detecção automática",
    "Move Backward": "",
    "Move Forward": "",
    "Top View": "",
    "Front View": "",
    "Zoom to Fit": "",
    "Right Side View": "",
    "Left Side View": "",
    "Custom range...": "Intervalo personalizado...",
    "Today": "Hoje",
    "Last {{n}} days": "Últimos {{n}} dias",
    "Apply": "Aplicar",
    "Add": "Adicionar",
    "Custom Jog Distance (mm)": "",
    "Custom Jog Distance (inches)": "",
    "Machine Profiles": "",
    "No machine profile selected": "",
    "Delete machine profile": "",
    "Machine Profile": "",
    "Limits": "",
    "User Accounts": "Contas de Utilizador",
    "New Account": "Nova Conta",
    "Hide Limits": "Ocultar Limites",
    "Show Limits": "Mostrar Limites",
    "WebGL: <1>Enabled</1>": "WebGL: <1>Ativado</1>",
    "WebGL: <1>Disabled</1>": "WebGL: <1>Desativado</1>",
    "Hide Cutting Tool": "Ocultar Ferramenta",
    "Show Cutting Tool": "Mostrar Ferramenta",
    "Ready to start": "",
    "Connect to an IP camera": "Conectar a câmera IP",
    "The URL must be for a Motion JPEG (mjpeg) HTTP or RTSP stream.": ""
}
