{
  "Records: {{from}} - {{to}} / {{total}}": "Registros: {{from}} - {{to}} / {{total}}",
  "Records: {{total}}": "Registros: {{total}}",
  "{{pageLength}} per page": "{{pageLength}} por página",
  "New update available": "Nueva actualización disponible",
  "Command succeeded": "Comando exitoso",
  "Command failed ({{err}})": "Comando fallido ({{err}})",
  "My Account": "Mi cuenta",
  "Signed in as {{name}}": "Conectado como {{name}}",
  "Account": "Cuenta",
  "Sign Out": "Cerrar sesión",
  "Options": "Opciones",
  "Command": "Comando",
  "Show notifications": "Mostrar notificaciones",
  "Help": "Ayuda",
  "Report an issue": "Reportar un problema",
  "Cycle Start": "Inicio de ciclo",
  "Feedhold": "Alimentar",
  "Homing": "Mover a inicio",
  "Sleep": "Suspender",
  "Unlock": "Desbloquear",
  "Reset": "Restablecer",
  "Authentication failed.": "Fallo de autenticación.",
  "Error": "Error",
  "Sign in to {{name}}": "Conectarse a {{name}}",
  "Username": "Nombre de usuario",
  "Password": "Contraseña",
  "Sign In": "Iniciar sesión",
  "Forgot your password?": "¿Olvido su contraseña?",
  "A web-based interface for CNC milling controller running Grbl, Smoothieware, or TinyG": "Una interfaz web para control de fresado CNC que ejecuta Grbl, Smoothieware o TinyG",
  "Learn more": "Más información",
  "Downloads": "Descargas",
  "Checking for updates...": "Buscando actualizaciones...",
  "A new version of {{name}} is available": "Hay una nueva versión de {{name}}",
  "Version {{version}}": "Versión {{version}}",
  "Latest version": "Versión más reciente",
  "You already have the newest version of {{name}}": "Ya tiene la versión más reciente de {{name}}",
  "New": "Nuevo",
  "Account status": "Estado de cuenta",
  "Name": "Nombre",
  "Confirm Password": "Confirmar contraseña",
  "Cancel": "Cancelar",
  "OK": "Sí",
  "An unexpected error has occurred.": "A ocurrido un error inesperado.",
  "Loading...": "Cargando...",
  "No data to display": "No hay información para mostrar",
  "Enabled": "Activada",
  "Disabled": "Desactivada",
  "Date Modified": "Fecha de modificación",
  "Action": "Acción",
  "Edit Account": "Editar cuenta",
  "Delete Account": "Eliminar cuenta",
  "Settings": "Configuración",
  "Are you sure you want to delete the account?": "¿Está seguro de eliminar la cuenta?",
  "Update": "Actualizar",
  "Old Password": "Contraseña anterior",
  "Change Password": "Cambiar contraseña",
  "New Password": "Nueva contraseña",
  "Commands": "Comandos",
  "Title": "Título",
  "and more...": "y más...",
  "Delete": "Eliminar",
  "Are you sure you want to delete this item?": "¿Está seguro de eliminar este ítem?",
  "Exception": "Excepción",
  "Continue execution when an error is detected in the G-code program": "Continuar ejecución cuando un error es detectado en el código G del programa",
  "Enabling this option may cause machine damage if you don't have an Emergency Stop button to prevent a dangerous situation.": "Habilitar esta opción podría causar daño a la máquina si no tiene un botón de paro de emergencia para prevenir una situación de riesgo.",
  "Save Changes": "Guardar cambios",
  "Events": "Eventos",
  "Event": "Evento",
  "Choose an event": "Elija un evento",
  "Startup (System only)": "Iniciar (Solo sistema)",
  "Open a serial port (System only)": "Abrir puerto serie (Solo sistema)",
  "Close a serial port (System only)": "Cerrar puerto serie(Solo sistema)",
  "G-code: Load": "Cargar código G",
  "G-code: Unload": "Subir código G",
  "G-code: Start": "Inciar código G",
  "G-code: Stop": "Detener código G",
  "G-code: Pause": "Pausar código G",
  "G-code: Resume": "Reanudar código G",
  "Feed Hold": "Alimentación",
  "Run Macro": "Iniciar macro",
  "Load Macro": "Cargar macro",
  "Trigger": "Disparador",
  "Choose an trigger": "Elegir disparador",
  "System": "Sistema",
  "G-code": "Código G",
  "Automatically check for updates": "Comprobar por actualizaciones automáticamente",
  "Language": "Idioma",
  "General": "General",
  "Workspace": "Espacio de trabajo",
  "Controller": "Controlador",
  "About": "Acerca de",
  "The account name is already being used. Choose another name.": "El nombre de la cuenta esta siendo usado. Elija otro nombre.",
  "Passwords do not match.": "Las contraseñas no coinciden.",
  "Import": "Importar",
  "Are you sure you want to overwrite the workspace settings?": "¿Está seguro de sobreescribir la configuración?",
  "Restore Defaults": "Restaurar valores predeterminados",
  "Are you sure you want to restore the default settings?": "¿Está seguro que desea restaurar los parámetros por defecto?",
  "Import Error": "Error de importación",
  "Invalid file format.": "Formato de archivo inválido.",
  "Close": "Cerrar",
  "Export": "Exportar",
  "Click the Continue button to resume execution.": "Dé clic en el botón Continuar para reanudar la ejecución.",
  "Stop": "Parar",
  "Continue": "Continuar",
  "Server has stopped working": "El servidor ha dejado de funcionar",
  "A problem caused the server to stop working correctly. Check out the server status and try again.": "Un problema hizo que el servidor dejara de funcionar correctamente. Compruebe el estado del servidor y vuelva a intentarlo.",
  "Reload": "Recargar",
  "Fork Widget": "Bifurcar widget",
  "Are you sure you want to fork this widget?": "¿Está seguro que desea bifurcar este widget?",
  "Remove Widget": "Eliminar widget",
  "Are you sure you want to remove this widget?": "¿Está seguro de eliminar este widget?",
  "On": "Activado",
  "Off": "Desactivado",
  "Visualizer Widget": "Widget de visualización",
  "This widget visualizes a G-code file and simulates the tool path.": "Este widget permite visualizar el código G y simula la ruta de la herramienta.",
  "Connection Widget": "Widget de conexión",
  "This widget lets you establish a connection to a serial port.": "Este widget permite establecer una conexión con un puerto serie.",
  "Console Widget": "Widget de la consola",
  "This widget lets you read and write data to the CNC controller connected to a serial port.": "Este widget permite leer y escribir datos al controlador CNC conectado a un puerto serie.",
  "Grbl Widget": "Widget Grbl",
  "This widget shows the Grbl state and provides Grbl specific features.": "Este widget muestra el estado de Grbl y proporciona características específicas de Grbl.",
  "Marlin Widget": "Widget Marlin",
  "This widget shows the Marlin state and provides Marlin specific features.": "Este widget muestra el estado de Marlin y proporciona características específicas de Marlin.",
  "Smoothie Widget": "Widget Smoothie",
  "This widget shows the Smoothie state and provides Smoothie specific features.": "Este widget muestra el estado Smoothie y proporciona características específicas de Smoothie.",
  "TinyG Widget": "Widget TinyG",
  "This widget shows the TinyG state and provides TinyG specific features.": "Este widget muestra el estado de TinyG y proporciona características específicas de TinyG.",
  "Axes Widget": "Widget de ejes",
  "This widget shows the XYZ position. It includes jog controls, homing, and axis zeroing.": "Este widget muestra la posición XYZ. Incluye controles de desplazamiento, inicio y desplazamiento a cero de ejes.",
  "G-code Widget": "Widget de código G",
  "This widget shows the current status of G-code commands.": "Este widget muestra el estado actual de comandos código G.",
  "Laser Widget": "Widget láser",
  "This widget allows you control laser intensity and turn the laser on/off.": "Este widget permite controlar la intensidad del láser y encender/apagar el láser.",
  "Macro Widget": "Widget de macros",
  "This widget can use macros to automate routine tasks.": "Este widget utiliza macros para automatizar tareas rutinarias.",
  "Probe Widget": "Widget de sonda",
  "This widget helps you use a touch plate to set your Z zero offset.": "Este widget le ayuda a usar una placa para establecer su desplazamiento con respecto al eje Z.",
  "Spindle Widget": "Widget de herramienta",
  "This widget provides the spindle control.": "Este widget proporciona el control de la herramienta.",
  "Custom Widget": "Widget personalizado",
  "This widget gives you a communication interface for creating your own widget.": "Este widget proporciona una interfaz de comunicación para crear su propio widget.",
  "Webcam Widget": "Widget de Webcam",
  "This widget lets you monitor a webcam.": "Este widget permite monitorear una webcam.",
  "Widgets": "Widgets",
  "M0 Program Pause": "M0 Pausa de programa",
  "M1 Program Pause": "M1 Pausa de programa",
  "M2 Program End": "M2 Fin de programa",
  "M30 Program End": "M30 Fin de programa",
  "M6 Tool Change": "M6 Cambio de herramienta",
  "M109 Set Extruder Temperature": "M109 Establecer temperatura de extrusor",
  "M190 Set Heated Bed Temperature": "M190 Establecer temperatura de cama caliente",
  "Drop G-code file here": "Suelte el archivo de código G aquí",
  "Manage Widgets ({{inactiveCount}})": "Administrar widgets ({{inactiveCount}})",
  "Collapse All": "Colapsar todos",
  "Expand All": "Expandir todos",
  "Corrupted workspace settings": "Configuración de espacio de trabajo dañada",
  "The workspace settings have become corrupted or invalid. Click Restore Defaults to restore default settings and continue.": "La configuración del área de trabajo se ha corrompido o no es válida. Dé clic en Restaurar valores predeterminados para restaurar la configuración predeterminada y continuar.",
  "Download workspace settings": "Descargar configuración del área de trabajo",
  "This field is required.": "Este campo es obligatorio.",
  "Passwords should be equal.": "Las contraseñas deben ser iguales.",
  "Work Coordinate System (G54)": "Sistema de coordenadas de trabajo (G55)",
  "Work Coordinate System (G55)": "Sistema de coordenadas de trabajo (G55)",
  "Work Coordinate System (G56)": "Sistema de coordenadas de trabajo (G56)",
  "Work Coordinate System (G57)": "Sistema de coordenadas de trabajo (G57)",
  "Work Coordinate System (G58)": "Sistema de coordenadas de trabajo (G58)",
  "Work Coordinate System (G59)": "Sistema de coordenadas de trabajo (G59)",
  "Go To Work Zero (G0 X0 Y0 Z0)": "Ir a cero de trabajo (G0 X0 Y0 Z0)",
  "Zero Out Work Offsets (G10 L20 P1 X0 Y0 Z0)": "Establecer en cero las compensaciones de trabajo (G10 L20 P1 X0 Y0 Z0)",
  "Zero Out Work Offsets (G10 L20 P2 X0 Y0 Z0)": "Establecer en cero las compensaciones de trabajo (G10 L20 P2 X0 Y0 Z0)",
  "Zero Out Work Offsets (G10 L20 P3 X0 Y0 Z0)": "Establecer en cero las compensaciones de trabajo (G10 L20 P3 X0 Y0 Z0)",
  "Zero Out Work Offsets (G10 L20 P4 X0 Y0 Z0)": "Establecer en cero las compensaciones de trabajo (G10 L20 P4 X0 Y0 Z0)",
  "Zero Out Work Offsets (G10 L20 P5 X0 Y0 Z0)": "Establecer en cero las compensaciones de trabajo (G10 L20 P5 X0 Y0 Z0)",
  "Zero Out Work Offsets (G10 L20 P6 X0 Y0 Z0)": "Establecer en cero las compensaciones de trabajo (G10 L20 P6 X0 Y0 Z0)",
  "Temporary Offsets (G92)": "Compensaciones temporales (G92)",
  "Zero Out Temporary Offsets (G92 X0 Y0 Z0)": "Establecer en cero las compensaciones temporales (G92 X0 Y0 Z0)",
  "Un-Zero Out Temporary Offsets (G92.1 X0 Y0 Z0)": "Deshacer las compensaciones temporales en cero (G92.1 X0 Y0 Z0)",
  "Machine Coordinate System (G53)": "Sistema de coordenadas de la máquina (G53)",
  "Go To Machine Zero (G53 G0 X0 Y0 Z0)": "Ir a cero máquina (G53 G0 X0 Y0 Z0)",
  "Set Machine Zero (G28.3 X0 Y0 Z0)": "Establecer cero máquina (G28.3 X0 Y0 Z0)",
  "Homing Sequence (G28.2 X0 Y0 Z0)": "Secuencia para mover a inicio (G28.2 X0 Y0 Z0)",
  "Go To Work Zero On X Axis (G0 X0)": "Ir a cero de trabajo en el eje X (G0 X0)",
  "Zero Out Work X Axis (G10 L20 P1 X0)": "Establecer en cero eje X de trabajo (G10 L20 P1 X0)",
  "Zero Out Work X Axis (G10 L20 P2 X0)": "Establecer en cero eje X de trabajo (G10 L20 P2 X0)",
  "Zero Out Work X Axis (G10 L20 P3 X0)": "Establecer en cero eje X de trabajo (G10 L20 P3 X0)",
  "Zero Out Work X Axis (G10 L20 P4 X0)": "Establecer en cero eje X de trabajo (G10 L20 P4 X0)",
  "Zero Out Work X Axis (G10 L20 P5 X0)": "Establecer en cero eje X de trabajo (G10 L20 P5 X0)",
  "Zero Out Work X Axis (G10 L20 P6 X0)": "Establecer en cero eje X de trabajo (G10 L20 P6 X0)",
  "Zero Out Temporary X Axis (G92 X0)": "Establecer en cero eje X temporal (G92 X0)",
  "Un-Zero Out Temporary X Axis (G92.1 X0)": "Deshacer cero en eje X temporal (G92.1 X0)",
  "Go To Machine Zero On X Axis (G53 G0 X0)": "Ir a cero máquina en el eje X (G53 G0 X0)",
  "Zero Out Machine X Axis (G28.3 X0)": "Establecer en cero eje X de máquina (G28.3 X0)",
  "Home Machine X Axis (G28.2 X0)": "Inicio de máquina eje X (G28.2 X0)",
  "Go To Work Zero On Y Axis (G0 Y0)": "Ir a cero de trabajo en el eje Y (G0 Y0)",
  "Zero Out Work Y Axis (G10 L20 P1 Y0)": "Establecer en cero eje Y de trabajo (G10 L20 P1 Y0)",
  "Zero Out Work Y Axis (G10 L20 P2 Y0)": "Establecer en cero eje Y de trabajo (G10 L20 P2 Y0)",
  "Zero Out Work Y Axis (G10 L20 P3 Y0)": "Establecer en cero eje Y de trabajo (G10 L20 P3 Y0)",
  "Zero Out Work Y Axis (G10 L20 P4 Y0)": "Establecer en cero eje Y de trabajo (G10 L20 P4 Y0)",
  "Zero Out Work Y Axis (G10 L20 P5 Y0)": "Establecer en cero eje Y de trabajo (G10 L20 P5 Y0)",
  "Zero Out Work Y Axis (G10 L20 P6 Y0)": "Establecer en cero eje Y de trabajo (G10 L20 P6 Y0)",
  "Zero Out Temporary Y Axis (G92 Y0)": "Establecer en cero eje Y temporal (G92 Y0)",
  "Un-Zero Out Temporary Y Axis (G92.1 Y0)": "Deshacer cero en eje Y temporal (G92.1 Y0)",
  "Go To Machine Zero On Y Axis (G53 G0 Y0)": "Ir a cero máquina en el eje Y (G53 G0 Y0)",
  "Zero Out Machine Y Axis (G28.3 Y0)": "Establecer en cero eje Y de máquina (G28.3 Y0)",
  "Home Machine Y Axis (G28.2 Y0)": "Inicio de máquina eje Y (G28.2 Y0)",
  "Go To Work Zero On Z Axis (G0 Z0)": "Ir a cero de trabajo en el eje Z (G0 Z0)",
  "Zero Out Work Z Axis (G10 L20 P1 Z0)": "Establecer en cero eje Z de trabajo (G10 L20 P1 Z0)",
  "Zero Out Work Z Axis (G10 L20 P2 Z0)": "Establecer en cero eje Z de trabajo (G10 L20 P2 Z0)",
  "Zero Out Work Z Axis (G10 L20 P3 Z0)": "Establecer en cero eje Z de trabajo (G10 L20 P3 Z0)",
  "Zero Out Work Z Axis (G10 L20 P4 Z0)": "Establecer en cero eje Z de trabajo (G10 L20 P4 Z0)",
  "Zero Out Work Z Axis (G10 L20 P5 Z0)": "Establecer en cero eje Z de trabajo (G10 L20 P5 Z0)",
  "Zero Out Work Z Axis (G10 L20 P6 Z0)": "Establecer en cero eje Z de trabajo (G10 L20 P6 Z0)",
  "Zero Out Temporary Z Axis (G92 Z0)": "Establecer en cero eje Z temporal (G92 Z0)",
  "Un-Zero Out Temporary Z Axis (G92.1 Z0)": "Deshacer cero en eje Z temporal (G92.1 Z0)",
  "Go To Machine Zero On Z Axis (G53 G0 Z0)": "Ir a cero máquina en el eje Z (G53 G0 Z0)",
  "Zero Out Machine Z Axis (G28.3 Z0)": "Establecer en cero eje Z de máquina (G28.3 Z0)",
  "Home Machine Z Axis (G28.2 Z0)": "Inicio de máquina eje Z (G28.2 Z0)",
  "Go To Work Zero On A Axis (G0 A0)": "Ir a cero de trabajo en el eje A (G0 A0)",
  "Zero Out Work A Axis (G10 L20 P1 A0)": "Establecer en cero eje A de trabajo (G10 L20 P1 A0)",
  "Zero Out Work A Axis (G10 L20 P2 A0)": "Establecer en cero eje A de trabajo (G10 L20 P2 A0)",
  "Zero Out Work A Axis (G10 L20 P3 A0)": "Establecer en cero eje A de trabajo (G10 L20 P3 A0)",
  "Zero Out Work A Axis (G10 L20 P4 A0)": "Establecer en cero eje A de trabajo (G10 L20 P4 A0)",
  "Zero Out Work A Axis (G10 L20 P5 A0)": "Establecer en cero eje A de trabajo (G10 L20 P5 A0)",
  "Zero Out Work A Axis (G10 L20 P6 A0)": "Establecer en cero eje A de trabajo (G10 L20 P6 A0)",
  "Zero Out Temporary A Axis (G92 A0)": "Establecer en cero eje A temporal (G92 A0)",
  "Un-Zero Out Temporary A Axis (G92.1 A0)": "Deshacer cero en eje A temporal (G92.1 A0)",
  "Go To Machine Zero On A Axis (G53 G0 A0)": "Ir a cero máquina en el eje A (G53 G0 A0)",
  "Zero Out Machine A Axis (G28.3 A0)": "Establecer en cero eje A de máquina (G28.3 A0)",
  "Home Machine A Axis (G28.2 A0)": "Inicio de máquina eje A (G28.2 A0)",
  "Go To Work Zero On B Axis (G0 B0)": "Ir a cero de trabajo en el eje B (G0 B0)",
  "Zero Out Work B Axis (G10 L20 P1 B0)": "Establecer en cero eje B de trabajo (G10 L20 P1 B0)",
  "Zero Out Work B Axis (G10 L20 P2 B0)": "Establecer en cero eje B de trabajo (G10 L20 P2 B0)",
  "Zero Out Work B Axis (G10 L20 P3 B0)": "Establecer en cero eje B de trabajo (G10 L20 P3 B0)",
  "Zero Out Work B Axis (G10 L20 P4 B0)": "Establecer en cero eje B de trabajo (G10 L20 P4 B0)",
  "Zero Out Work B Axis (G10 L20 P5 B0)": "Establecer en cero eje B de trabajo (G10 L20 P5 B0)",
  "Zero Out Work B Axis (G10 L20 P6 B0)": "Establecer en cero eje B de trabajo (G10 L20 P6 B0)",
  "Zero Out Temporary B Axis (G92 B0)": "Establecer en cero eje B temporal (G92 B0)",
  "Un-Zero Out Temporary B Axis (G92.1 B0)": "Deshacer cero en eje B temporal (G92.1 B0)",
  "Go To Machine Zero On B Axis (G53 G0 B0)": "Ir a cero máquina en el eje B (G53 G0 B0)",
  "Zero Out Machine B Axis (G28.3 B0)": "Establecer en cero eje B de máquina (G28.3 B0)",
  "Home Machine B Axis (G28.2 B0)": "Inicio de máquina eje B (G28.2 B0)",
  "Go To Work Zero On C Axis (G0 C0)": "Ir a cero de trabajo en el eje C (G0 C0)",
  "Zero Out Work C Axis (G10 L20 P1 C0)": "Establecer en cero eje C de trabajo (G10 L20 P1 C0)",
  "Zero Out Work C Axis (G10 L20 P2 C0)": "Establecer en cero eje C de trabajo (G10 L20 P2 C0)",
  "Zero Out Work C Axis (G10 L20 P3 C0)": "Establecer en cero eje C de trabajo (G10 L20 P3 C0)",
  "Zero Out Work C Axis (G10 L20 P4 C0)": "Establecer en cero eje C de trabajo (G10 L20 P4 C0)",
  "Zero Out Work C Axis (G10 L20 P5 C0)": "Establecer en cero eje C de trabajo (G10 L20 P5 C0)",
  "Zero Out Work C Axis (G10 L20 P6 C0)": "Establecer en cero eje C de trabajo (G10 L20 P6 C0)",
  "Zero Out Temporary C Axis (G92 C0)": "Establecer en cero eje C temporal (G92 C0)",
  "Un-Zero Out Temporary C Axis (G92.1 C0)": "Deshacer cero en eje C temporal (G92.1 C0)",
  "Go To Machine Zero On C Axis (G53 G0 C0)": "Ir a cero máquina en el eje C (G53 G0 C0)",
  "Zero Out Machine C Axis (G28.3 C0)": "Establecer en cero eje C de máquina (G28.3 C0)",
  "Home Machine C Axis (G28.2 C0)": "Inicio de máquina eje C (G28.2 C0)",
  "mm": "mm",
  "in": "in",
  "deg": "grados",
  "Zero Out Machine": "Establecer máquina a cero",
  "Home Machine": "Inicio de máquina",
  "Zero Out Work Offsets": "Establecer a cero las compensaciones de trabajo",
  "Set Work Offsets": "Establecer compensaciones de trabajo",
  "Axis": "Ejes",
  "Machine Position": "Posición de máquina",
  "Work Position": "Posición de trabajo",
  "Axes": "Ejes",
  "Keypad jogging": "Movimiento con teclado",
  "Edit": "Editar",
  "Expand": "Expandir",
  "Collapse": "Colapsar",
  "More": "Más",
  "Enter Full Screen": "Entrar a pantalla completa",
  "Exit Full Screen": "Salir de pantalla completa",
  "Move X- Y+": "Mover X- Y+",
  "Move Y+": "Mover Y+",
  "Move X+ Y+": "Mover X+ Y+",
  "Move Z+": "Mover Z+",
  "Move X-": "Mover X-",
  "Move To XY Zero (G0 X0 Y0)": "Mover a cero XY (G0 X0 Y0)",
  "Move X+": "Mover X+",
  "Move To Z Zero (G0 Z0)": "Mover a cero Z (G0 Z0)",
  "Move X- Y-": "Mover X- Y-",
  "Move Y-": "Mover Y-",
  "Move X+ Y-": "Mover X+ Y-",
  "Move Z-": "Mover Z-",
  "Units": "Unidades",
  "G20 (inch)": "G20 (pulgada)",
  "G21 (mm)": "G21 (mm)",
  "Imperial": "Imperial",
  "Metric": "Métrico",
  "Right": "Derecha",
  "Left": "Izquierda",
  "Up": "Arriba",
  "Down": "Abajo",
  "Page Up": "Subir página",
  "Page Down": "Bajar página",
  "Right Square Bracket": "Corchete de cierre",
  "Left Square Bracket": "Corchete de apertura",
  "0.1x Move": "Mover 0.1x",
  "Alt": "Alt",
  "10x Move": "Mover 10x",
  "⇧ Shift": "⇧ Mayús",
  "X-axis": "Eje-X",
  "Y-axis": "Eje-Y",
  "Z-axis": "Eje-Z",
  "A-axis": "Eje-A",
  "B-axis": "Eje-B",
  "C-axis": "Eje-C",
  "Custom Commands": "Comandos personalizados",
  "Axes Settings": "Configuración de ejes",
  "ShuttleXpress": "ShuttleXpress",
  "Feed Rate Range: {{min}} - {{max}} mm/min": "Rango de tasa de alimentación: {{min}} - {{max}} mm/min",
  "Repeat Rate: {{hertz}}Hz": "Tasa de repetición: {{hertz}}Hz",
  "60 Times per Second": "60 veces por segundo",
  "45 Times per Second": "45 veces por segundo",
  "30 Times per Second": "30 veces por segundo",
  "15 Times per Second": "15 veces por segundo",
  "10 Times per Second": "10 veces por segundo",
  "5 Times per Second": "5 veces por segundo",
  "2 Times per Second": "2 veces por segundo",
  "Once Every Second": "1 vez cada segundo",
  "Distance Overshoot: {{overshoot}}x": "Superación de distancia: {{overshoot}}x",
  "Manufacturer: {{manufacturer}}": "Fabricante: {{manufacturer}}",
  "Port": "Puerto",
  "No ports available": "No hay puertos disponibles",
  "Choose a port": "Elija un puerto",
  "Refresh": "Actualizar",
  "Baud rate": "Tasa de baudios",
  "Choose a baud rate": "Elija una tasa de baudios",
  "Connect automatically": "Conectar automáticamente",
  "Open": "Abrir",
  "Error opening serial port '{{- port}}'": "Error al abrir el puerto serie '{{- port}}'",
  "Connection": "Conexión",
  "No serial connection": "No hay conexión con el puerto serie",
  "Connected to {{-port}} with a baud rate of {{baudrate}}": "Conectado al puerto {{-port}} con un baud rate de {{baudrate}}",
  "Console": "Consola",
  "Clear all": "Borrar todo",
  "Select All": "Seleccionar todo",
  "Clear Selection": "Limpiar selección",
  "URL not configured": "URL no configurada",
  "The widget is currently disabled": "El widget está deshabilitado",
  "Enable": "Activar",
  "Disable": "Desactivar",
  "URL": "URL",
  "Min": "Mín",
  "Max": "Máx",
  "Dimension": "Dimensión",
  "Sent": "Enviado",
  "Received": "Recibido",
  "Start Time": "Tiempo de inicio",
  "Elapsed Time": "Tiempo transcurrido",
  "Finish Time": "Tiempo de finalización",
  "Remaining Time": "Tiempo restante",
  "Controller State": "Estado del controlador",
  "Controller Settings": "Ajustes del controlador",
  "Hide": "Ocultar",
  "Show": "Mostrar",
  "Queue Reports": "Informes de cola",
  "Planner Buffer": "Búfer del planificador",
  "Receive Buffer": "Búfer de recepción",
  "Status Reports": "Reporte de estado",
  "State": "Estado",
  "Feed Rate": "Velocidad de avance",
  "Spindle": "Herramienta",
  "Tool Number": "Número de herramienta",
  "Modal Groups": "Grupos modales",
  "Motion": "Movimiento",
  "Coordinate": "Coordenada",
  "Plane": "Plano",
  "Distance": "Distancia",
  "Program": "Programa",
  "Coolant": "Refrigerante",
  "Status Report (?)": "Reporte de estado (?)",
  "Check G-code Mode ($C)": "Comprobar modo código G ($C)",
  "Homing ($H)": "Mover a inicio ($H)",
  "Kill Alarm Lock ($X)": "Desactivar bloqueo por alarma ($X)",
  "Sleep ($SLP)": "Suspensión ($SLP)",
  "Help ($)": "Ayuda ($)",
  "Settings ($$)": "Configuración ($$)",
  "View G-code Parameters ($#)": "Ver parámetros del código G ($#)",
  "View G-code Parser State ($G)": "Ver el estado del analizador del código G ($G)",
  "View Build Info ($I)": "Ver información de compilación ($I)",
  "View Startup Blocks ($N)": "Ver bloques de inicio ($N)",
  "Laser": "Láser",
  "Laser Intensity Control": "Control de intensidad de láser",
  "Laser Test": "Probar láser",
  "Power (%)": "Potencia (%)",
  "Test duration": "Duración de la prueba",
  "ms": "ms",
  "Maximum value": "Valor máximo",
  "Laser Off": "Láser apagado",
  "New Macro": "Nueva macro",
  "Macro Name": "Nombre de macro",
  "Macro Commands": "Comandos de macro",
  "Macro Variables": "Variables de macro",
  "Edit Macro": "Editar macro",
  "Delete Macro": "Eliminar macro",
  "Are you sure you want to delete this macro?": "¿Esta seguro de eliminar esta macro?",
  "No": "No",
  "Yes": "Sí",
  "Macro": "Macro",
  "Are you sure you want to load this macro?": "¿Está seguro de cargar esta macro?",
  "No macros": "No hay Macros",
  "Run": "Ejecutar",
  "Get Extruder Temperature (M105)": "Obtener temperatura de extrusor (M105)",
  "Get Current Position (M114)": "Obtener posición actual (M114)",
  "Get Firmware Version and Capabilities (M115)": "Obtener versión de firmware y prestaciones (M115)",
  "Heater Control": "Control de calentador",
  "Extruder": "Extrusor",
  "°C": "°C",
  "Set the target temperature for the extruder": "Establecer la temperatura objetivo para el extrusor",
  "Heated Bed": "Cama caliente",
  "Set the target temperature for the heated bed": "Establecer la temperatura objetivo para la cama caliente",
  "Extruder Temperature": "Temperatura de extrusor",
  "Heated Bed Temperature": "Temperatura de cama caliente",
  "Extruder Power": "Potencia de extrusor",
  "Heated Bed Power": "Potencia de cama caliente",
  "Probe": "Sonda",
  "mm/min": "mm/min",
  "in/min": "in/min",
  "Probe Command": "Comando de sonda",
  "G38.2 probe toward workpiece, stop on contact, signal error if failure": "G38.2 acercar sonda hacia la pieza de trabajo, paro al contacto, señal de error en caso de fallo",
  "G38.3 probe toward workpiece, stop on contact": "G38.3 acercar sonda hacia la pieza de trabajo, paro al contacto",
  "G38.4 probe away from workpiece, stop on loss of contact, signal error if failure": "G38.4 alejar sonda de la pieza de trabajo, paro en caso de pérdida de contacto, señal de error en caso de fallo",
  "G38.5 probe away from workpiece, stop on loss of contact": "G38.5 alejar sonda de la pieza de trabajo, paro en caso de pérdida de contacto",
  "Probe Depth": "Profundidad de la sonda",
  "Probe Feedrate": "Tasa de avance de sonda",
  "Touch Plate Thickness": "Grosor del plato de prueba",
  "Retraction Distance": "Distancia de retracción",
  "Apply tool length offset": "Aplicar desplazamiento de la longitud de la herramienta",
  "Run Probe": "Inicio la sonda",
  "Probe Axis": "Eje de la sonda",
  "Probe X Axis": "Sonda Eje-X",
  "Probe Y Axis": "Sonda Eje-Y",
  "Probe Z Axis": "Sonda Eje-Z",
  "Spindle Speed": "Velocidad de herramienta",
  "RPM": "RPM",
  "Queue Flush (%)": "Vaciado de cola (%)",
  "Kill Job (^d)": "Detener proceso (^d)",
  "Clear Alarm ($clear)": "Borrar alarma ($clear)",
  "Show System Settings": "Mostrar configuración del sistema",
  "Show All Settings": "Mostrar toda la configuración",
  "List Self Tests": "Listar autopruebas",
  "Power Management": "Administración de energia",
  "Enable Motors": "Habilitar motores",
  "Disable Motors": "Deshabilitar motores",
  "Motor {{n}}": "Motor {{n}}",
  "Velocity": "Velocidad",
  "Line": "Línea",
  "Path": "Ruta",
  "G-code not loaded": "Código G no cargado",
  "Tool Change": "Cambio de herramienta",
  "Are you sure you want to resume program execution?": "¿Está seguro que desea reanudar la ejecución del programa?",
  "Click the Resume button to resume program execution.": "Dé clic en el botón Reanudar para reanudar con la ejecución del programa.",
  "Click the Stop button to stop program execution.": "Dé clic en el botón de paro para detener la ejecución del programa.",
  "Run a tool change macro to change the tool and adjust the Z-axis offset. Afterwards, click the Resume button to resume program execution.": "Ejecutar una macro de cambio de herramienta para cambiar la herramienta y ajustar el desplazamiento del eje Z. Posteriormente, dé clic en el botón Reanudar para reanudar la ejecución del programa.",
  "Waiting for the target temperature to be reached...": "Esperando a que la temperatura objetivo sea alcanzada...",
  "Work Coordinate System": "Sistema de coordenadas de trabajo",
  "Enable 3D View": "Activar vista 3D",
  "Disable 3D View": "Desactivar vista 3D",
  "3D View": "Vista 3D",
  "Projection": "Proyección",
  "Perspective Projection": "Proyección de perspectiva",
  "Orthographic Projection": "Proyección ortográfica",
  "Display G-code Filename": "Mostrar nombre del código G",
  "Hide Coordinate System": "Ocultar coordenadas del sistema",
  "Show Coordinate System": "Mostrar coordenadas del sistema",
  "Hide Grid Line Numbers": "Ocultar números de línea de cuadrícula",
  "Show Grid Line Numbers": "Mostrar números de línea de cuadrícula",
  "File folder": "Carpeta de archivos",
  "{{extname}} File": "Archivo {{extname}}",
  "File": "Archivo",
  "3D rendering": "Renderización en 3D",
  "Zoom In": "Acercar",
  "Zoom Out": "Alejar",
  "Move the camera": "Mover la cámara",
  "Rotate the camera": "Rotar la cámara",
  "Watch Directory": "Ver directorio",
  "Date modified": "Fecha de modificación",
  "Type": "Tipo",
  "Size": "Tamaño",
  "Load G-code": "Cargar código G",
  "Upload G-code": "Subir código G",
  "Browse...": "Buscar...",
  "Resume": "Reanudar",
  "Pause": "Pausar",
  "Webcam": "Cámara web",
  "Webcam Settings": "Configuración de la cámara web",
  "Media Source": "Fuente de medios",
  "Use a built-in camera or a connected webcam": "Usar cámara interna o una cámara conectada",
  "Webcam is off": "La cámara web está apagada",
  "Rotate Left": "Rotar a la izquierda",
  "Rotate Right": "Rotar a la derecha",
  "Flip Horizontally": "Voltear horizontalmente",
  "Flip Vertically": "Voltear verticalmente",
  "Crosshair": "Punto de mira",
  "Manual Data Input": "Entrada de datos manual",
  "MDI": "MDI",
  "Button Width": "Ancho de botón",
  "Order": "Comando",
  "Move Up": "Mover hacia arriba",
  "Move Down": "Mover hacia abajo",
  "Remove": "Eliminar",
  "Waiting for the planner to empty...": "Esperando a que se vacíe el planificador...",
  "No video devices available": "No hay dispositivos de video disponibles",
  "Choose a video device": "Elegir un dispositivo de video",
  "Automatic detection": "Detección automática",
  "Front View": "Vista frontal",
  "Move Backward": "Mover hacia atrás",
  "Move Forward": "Mover hacia delante",
  "Top View": "Vista superior",
  "Zoom to Fit": "Acercamiento para ajustar",
  "Right Side View": "Vista lateral derecha",
  "Left Side View": "Vista lateral izquierda",
  "Custom range...": "Intervalo personalizado...",
  "Today": "Hoy",
  "Last {{n}} days": "Últimos {{n}} días",
  "Apply": "Aplicar",
  "Add": "Agregar",
  "Custom Jog Distance (mm)": "Distancia personalizada de movimiento (mm)",
  "Custom Jog Distance (inches)": "Distancia personalizada de movimiento (pulgadas)",
  "Machine Profiles": "Perfiles de máquina",
  "No machine profile selected": "No se seleccionó un perfil de máquina",
  "Delete machine profile": "Eliminar perfil de máquina",
  "Machine Profile": "Perfil de máquina",
  "Limits": "Límites",
  "User Accounts": "Cuentas de usuario",
  "New Account": "Nueva cuenta",
  "Hide Limits": "Ocultar límites",
  "Show Limits": "Mostrar límites",
  "WebGL: <1>Enabled</1>": "WebGL: <1>Activado</1>",
  "WebGL: <1>Disabled</1>": "WebGL: <1>Desactivado</1>",
  "Hide Cutting Tool": "Ocultar herramienta de corte",
  "Show Cutting Tool": "Mostrar herramienta de corte",
  "Ready to start": "Listo para iniciar",
  "Connect to an IP camera": "Conectar a una cámara IP",
  "The URL should point to a stream in one of the following formats: Motion JPEG (mjpeg), RTSP, or H264 (MP4).": "La URL debería de apuntar a una transmisión de video en uno de los siguientes formatos: Motion JPEG (mjpeg), RTSP, o H264 (MP4).",
  "Set DTR line status upon opening": "Establecer el estado de línea DTR al abrir",
  "SET": "EN 1",
  "CLR": "EN 0",
  "Set RTS line status upon opening": "Establecer el estado de la línea RTS al abrir",
  "Use RTS/CTS flow control": "Utilizar control de flujo RTS/CTS",
  "Data Collection": "Recolección de Datos",
  "Enable anonymous usage data collection": "Habilitar la recolección de datos de uso anónimos",
  "Display language:": "Idioma de visualización:",
  "Tool Widget": "Widget de Herramienta",
  "This widget manages workflows for tool changes.": "Este widget gestiona los flujos de trabajo para los cambios de herramientas.",
  "Tool": "Herramienta",
  "No available tool configuration": "No hay configuración de herramienta disponible",
  "Tool Change Policy": "Política de Cambio de Herramienta",
  "Ignore M6 commands (Default)": "Ignorar comandos M6 (Predeterminado)",
  "Send M6 commands": "Enviar comandos M6",
  "Manual Tool Change (WCS)": "Cambio de Herramienta Manual (WCS)",
  "Manual Tool Change (TLO)": "Cambio de Herramienta Manual (TLO)",
  "This will send the line exactly as it is to the controller.": "Esto enviará la línea tal como está al controlador.",
  "Tool Change Position": "Posición de Cambio de Herramienta",
  "Use the current machine position as the tool change position.": "Utilizar la posición actual de la máquina como posición de cambio de herramienta.",
  "Tool Probe Position": "Posición de Sonda de Herramienta",
  "Use the current machine position as the tool probe position.": "Utilizar la posición actual de la máquina como posición de sonda de herramienta.",
  "Custom Tool Probe Commands": "Comandos Personalizados de Sonda de Herramienta",
  "Probe Distance": "Distancia de Sonda",
  "Touch Plate Height": "Altura de la Placa de Contacto",
  "Tool Probe Commands": "Comandos de Sonda de Herramienta",
  "Copied": "Copiado",
  "Copy": "Copiar",
  "Import predefined tool probe commands to update the Z-axis offset in the Work Coordinate System (WCS)": "Importar comandos de sonda de herramienta predefinidos para actualizar el desplazamiento del eje Z en el Sistema de Coordenadas de Trabajo (WCS)",
  "Import predefined tool probe commands to update the Tool Length Offset (TLO)": "Importar comandos de sonda de herramienta predefinidos para actualizar el Desplazamiento de la Longitud de la Herramienta (TLO)",
  "Warning: No custom tool probe commands are defined": "Advertencia: No se han definido comandos de sonda de herramienta personalizados",
  "Connect to the controller to view the tool probe commands.": "Conéctese al controlador para ver los comandos de sonda de herramienta.",
  "Manual Tool Change (Custom Probing)": "Cambio de herramienta manual (Sondeo personalizado)",
  "This option skips the M6 command and pauses controller operations, giving you full manual control over the tool change process.": "Esta opción omite el comando M6 y pausa las operaciones del controlador, dándole control manual completo sobre el proceso de cambio de herramienta."
}
